package nexuslink.charon.douya.bean.book;

import java.util.List;

///**
// * Created by Charon on 2017/7/11.
// */

public class BookData {

    /**
     * count : 20
     * start : 0
     * total : 1977
     * books : [{"rating":{"max":10,"numRaters":4437,"average":"9.2","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"1994-04","tags":[{"count":906,"name":"四大名著","title":"四大名著"},{"count":717,"name":"小说","title":"小说"},{"count":648,"name":"西游记","title":"西游记"},{"count":561,"name":"古典文学","title":"古典文学"},{"count":344,"name":"中国古典文学","title":"中国古典文学"},{"count":332,"name":"中国","title":"中国"},{"count":312,"name":"名著","title":"名著"},{"count":262,"name":"古典","title":"古典"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s9125702.jpg","binding":"精装","translator":[],"catalog":"前言\n校评说明\n第一回 灵根育孕源流出 心性修持大道生\n第二回 悟彻菩提真妙理 断魔归本合元神\n第三回 四海千山皆拱伏 九幽十类尽除名\n第四回 官封弼马心何足 名注齐天意未宁\n第五回 乱蟠桃大圣偷丹 反天宫诸神捉妖\n第六回 观音赴会问原因 小圣施威降大圣\n第七回 八卦炉中逃大圣 五行山下定心猿\n第八回 我佛造经传极乐 观音奉旨上长安\n第九回 袁守诚妙算无私曲 老龙王拙计犯天条\n第十回 二将军宫门镇鬼 唐太宗地府还魂","pages":"764","images":{"small":"https://img3.doubanio.com/spic/s9125702.jpg","large":"https://img3.doubanio.com/lpic/s9125702.jpg","medium":"https://img3.doubanio.com/mpic/s9125702.jpg"},"alt":"https://book.douban.com/subject/1061803/","id":"1061803","publisher":"岳麓书社","isbn10":"7805200556","isbn13":"9787805200552","title":"西游记","url":"https://api.douban.com/v2/book/1061803","alt_title":"","author_intro":"吴承恩(1501年-1582年)，汉族。字汝忠，号射阳山人，淮安府山阳县（今江苏省淮安市楚州区）人,明代小说家。吴承恩大约40岁才补得一个岁贡生，到北京等待分配官职，没有被选上，由于母老家贫，去做了长兴县丞，终因受人诬告，两年后\u201c拂袖而归\u201d，晚年以卖文为生，大约活了82岁。\n《天启淮安府志》评价他\u201c性敏而多慧，博极群书，为诗文下笔立成，清雅流丽，有秦少游之风。复善谐谑，所著杂记几种，名震一时\u201d。不过都是他死后的事了。他一生创作丰富，但是由于家贫，又没有子女，作品多散失。据记载有志怪小说集《禹鼎记》已失传。目前只遗留后人辑的《射阳先生存稿》四卷。一般公认他是中国的《西游记》的最后定稿作者，但也有观点认为不是，目前在学术界保持着争议(旧时传说是元朝的全真教道人丘处机)。\n出生于一个由下级官吏沦落为小商人的家庭，他的父亲吴锐性格乐观旷达，奉行常乐哲学，为儿子取名承恩，字汝忠，意思希望他能读书做官，上承皇恩，下泽黎民，做一个青史留名的忠臣。吴承恩小时候勤奋好学，一目十行，过目成诵。他精于绘画，擅长书法，爱好填词度曲，对围棋也很精通，还喜欢收藏名人的书画法帖。少年时代他就因为文才出众而在故乡出了名，受到人们的赏识，认为他科举及第，\u201c如拾一芥\u201d。\n他除奋好学外，特别喜欢搜奇猎怪，爱看神仙鬼怪，狐妖猴精之类的书籍。如《百怪录》、《酉阳杂俎》之类的小说野史，这类五光十色的神话世界，潜默化中养成了搜奇猎怪的嗜好，随着年龄的增大，这种爱好有增无减，这对他创作《西游记》有着重大的影响。30岁后，他搜求的奇闻已\u201c贮满胸中\u201d了，并且有了创作的打算。50岁左右，他写了《西游记》的前十几回，后来因故中断了多年，直到晚年辞官离任回到故里，他才得以最后完成《西游记》的创作，历时7年。\n步入青年时代的吴承恩是狂放不羁、轻世傲物的年青人。社会地位的低下，贫穷困苦的处境，使这位大才子狂放不羁，招来了纷至沓来的笑声，被人交口称誉的日子一去不复返了。吴承恩约二十岁时，与同乡一位姓叶的姑娘结婚，婚后感情甚笃。吴承恩虽然狂放不羁，但他品行端正，忠于自己的妻室。嘉靖十年，吴承恩在府学岁考和科考中获得了优异成绩，取得了科举生员的资格，与朋友结伴去南京应乡试。然而才华不如他的同伴考取了，他这位誉满乡里的才子竟名落孙山。第二年春天，他的父亲怀着遗憾去世了。接受初次失败的教训，吴承恩在以后三年内，专心致意地在时文上下了一番苦功，在嘉靖十三年秋的考试中却仍然没有考中。吴承恩羞恨交加，这年冬天，竟病倒了。两次乡试的失利，再加上父亲的去世，对吴承恩的打击是沉重的。在他看来，考不取举人，不仅付资无由，而且愧对父母，有负先人。但他并不以为自己没考取是没本事，而只是命运不济，他认为\u201c功名富贵自有命，必须得之无乃痴？\u201d\n吴承恩一生不同流俗，刚直不阿。他之所以才高而屡试不第，很可能与他不愿作违心之论以讨好上官有关。他厌恶腐败的官场，不愿违背本心，对黑暗的现实持否定态度。他在《二郎搜山图歌》一诗中写道：\u201c民灾翻出衣冠中，不为猿鹤为沙虫。坐观宋室用五鬼，不见虞廷诛四凶。野夫有怀多感激，抚事临风三叹惜。胸中磨损斩邪刀，欲起平之恨无力。救月有矢救日弓，世间岂谓无英雄？谁能为我致麟凤，长令万年保合清宁功。\u201d认为\u201c民灾\u201d的形成，社会现实的丑恶，原因就在于统治者用人不善，让\u201c五鬼\u201d\u201c四凶\u201d那样的坏人当道。他想\u201c致麟凤\u201d，行\u201c王道\u201d，扭转乾坤，但是怀才不遇，壮志未酬，只能空怀慷慨，抚事临风叹息。生活困顿给吴承恩带来的压力并不小于科考的失利。父亲去世以后，他需要操持全家的所有开支，但他却没有支撑门户的能力，更没有养家活口的手段。家中生活来源，除了每月从学府里领回六斗米外，只能坐食父亲所留遗产了。品尝了社会人生酸甜苦辣的吴承恩，开始更加清醒地、深沉地考虑社会人生的问题，并且用自己的诗文向不合理的社会进行抗争。","summary":"《西游记》的艺术虚构正是建立在传统艺术经验和这种社会的宗教性观念和风习的基础之上的，但它又以作者融会了传统艺术经验所形成的艺术的独创性批判了社会的宗教性观念，或更正确地说，和社会的宗教性观念开了玩笑，进行了潮弄。这是这部演述超人间故事的神魔小说最突出、最优异的品质，也是它的艺术价值和魅力的最根本的所在。\n《西游记》的主旨就是在于政治批判，那就和小说的形象和意蕴不符了。对现实政治的讽刺顶多只是这部神魔小说的附带性的内容，是信手拈来之笔，是讽喻世态人情中的涉笔成趣。一部小说如果不包含丰富的、多元的、在众多棱面上映射出众多意象的内涵，就不成其为多姿多采的有生命力的艺术品，不会万古长新。","series":{"id":"10185","title":"古典名著普及文库"},"price":"15.00"},{"rating":{"max":10,"numRaters":577,"average":"9.2","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2005-4","tags":[{"count":148,"name":"四大名著","title":"四大名著"},{"count":104,"name":"吴承恩","title":"吴承恩"},{"count":97,"name":"小说","title":"小说"},{"count":68,"name":"古典名著","title":"古典名著"},{"count":63,"name":"古典文学","title":"古典文学"},{"count":50,"name":"西游","title":"西游"},{"count":41,"name":"中国","title":"中国"},{"count":40,"name":"文学","title":"文学"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s10327151.jpg","binding":"简裝本","translator":["黄永年/黄寿成（点校）"],"catalog":"","pages":"550","images":{"small":"https://img3.doubanio.com/spic/s10327151.jpg","large":"https://img3.doubanio.com/lpic/s10327151.jpg","medium":"https://img3.doubanio.com/mpic/s10327151.jpg"},"alt":"https://book.douban.com/subject/1321544/","id":"1321544","publisher":"中华书局","isbn10":"7101046118","isbn13":"9787101046113","title":"西游记","url":"https://api.douban.com/v2/book/1321544","alt_title":"","author_intro":"","summary":"《西游记》主要描写的是孙悟空保唐僧西天取经，历经九九八十一难的故事。唐僧取经是历史上一件真实的事。大约距今一千三百多年前，即唐太宗贞观元年（627），年仅25岁的青年和尚玄奘离开京城长安，只身到天竺（印度）游学。他从长安出发后，途经中亚、阿富汗、巴基斯坦，历尽艰难险阻，最后到达了印度。他在那里学习了两年多，并在一次大型佛教经学辩论会任主讲，受到了赞誉。贞观十九年（645）玄奘回到了长安，带回佛经657部。他这次西天取经，前后十九年，行程几万里，是一次传奇式的万里长征，轰动一时。后来玄奘口述西行见闻，由弟子辩机辑录成《大唐西域记》十二卷。但这部书主要讲述了路上所见各国的历史、地理及交通，没有什么故事。及到他的弟子慧立、彦琮撰写的《大唐大慈恩寺三藏法师传》，则为玄奘的经历增添了许多神话色彩，从此，唐僧取经的故事便开始在民间广为流传。南宋有《大唐三藏取经诗话》，金代院本有《唐三藏》、《蟠桃会》等，元杂剧有吴昌龄的《唐三藏西天取经》、无名氏的《二郎神锁齐大圣》等，这些都为《西游记》的创作奠定了基础。吴承恩也正是在民间传说和话本、戏曲的基础上，经过艰苦的再创造，完成了这部令中华民族为之骄傲的伟大大文学巨著。\n吴承恩，字汝忠，号射阳山人，淮安府山阳（今江苏省淮安市）人。约生于明弘治十三年至正德初年之间（1500\u20141510），约卒于万历十年（1582）。吴承恩的曾祖父、祖父都是读书人，任过县学的训导、教谕。但到了他父亲吴锐这一辈，由于家贫困，出赘徐家，\u201c遂袭徐氏业，坐肆中\u201d，当起了小商人。尽管如此，吴家却不失读书的传统。据说其父吴锐虽为商人，不仅为人正派，而且好读书，好谈时政，这自然对吴承恩产生较大影响。吴承恩从小就很聪明，很早入了学，少年得志，名满乡里。天启《淮安府志》卷十六说吴承恩\u201c性敏而多慧，博极群书，为诗文，下笔立成。\u201d但成年后的吴承恩却很不顺利，在科举进身的道路上屡遭挫折，到四十多岁才补了一个岁贡生，五十多岁任过浙江长兴县丞，后又担任过荆王府纪善，这是同县丞级别差不多的闲职。吴承恩创作《西游记》大约是中年以后，或认为是晚年所作，具体时间无法确定。除《西游记》外，他还创作有长诗《二郎搜山图歌》和《禹鼎志》。现存《射阳先生存稿》四卷，包括诗一卷、散文三卷，是吴承恩逝世后由丘度编订而成。\n《西游记》全书一百回，从大的结构上看，可分成三个部分。第一回至第八回是第一部分，主要写了孙悟空出世、拜师、大闹天宫，这是全书最精彩的章节，热闹非凡，孙悟空上天入地好一顿折腾，将他的反抗性格表现得淋漓尽致。第八回至第十二回是第二部分，主要写了唐僧的出身及取经的缘由。第十三回至最后一回是第三部分，主要写唐僧西天取经，路上先后收了孙悟空、猪八戒、沙和尚三个徒弟，并历经九九八十一难，终于取到了真经，修成了正果。\n《西游记》向人们展示了一个绚丽多彩的神魔世界，人们无不在作者丰富而大胆的艺术想象面前惊叹不已。然而，任何一部文学作品都是一定社会生活的反映，作为神魔小说杰出代表的《西游记》亦不例外。正如鲁迅先生在《中国小说史略》中指出，《西游记》\u201c讽刺揶揄则取当时世态，加以铺张描写\u201d。又说：\u201c作者禀性，\u2018复善谐剧\u2019，故虽述变幻恍忽之事，亦每杂解颐之言，使神魔皆有人情，精魅亦通世故。\u201d的确如此。通过《西游记》中虚幻的神魔世界，我们处处可以看到现实社会的投影。如在孙悟空的形象创造上，就寄托了作者的理想。孙悟空那种不屈不挠的斗争精神，奋起金箍棒，横扫一切妖魔鬼怪的大无畏气概，反映了人民的愿望和要求。他代表了一种正义的力量，表现出人民战胜一切困难的必胜信念。又如取经路上遇到的那些妖魔，或是自然灾难的幻化，或是邪恶势力的象征。他们的贪婪、凶残、阴险和狡诈，也正是封建社会里的黑暗势力的特点。不仅如此，玉皇大帝统治的天宫、如来佛祖管辖的西方极乐世界，也都浓浓地涂上了人间社会的色彩。而作者对封建社会最高统治者的态度也颇可玩味，在《西游记》中，简直找不出一个称职的皇帝；至于昏聩无能的玉皇大帝、宠信妖怪的车迟国国王、要将小儿心肝当药引子的比丘国国王，则不是昏君就是暴君。对这些形象的刻画，即使是信手拈来，也无不具有很强的现实意义。\n《西游记》不仅有较深刻的思想内容，艺术上也取得了很高的成就。它以丰富奇特的艺术想象、生动曲折的故事情节，栩栩如生的人物形象，幽默诙谐的语言，构筑了一座独具特色的《西游记》艺术宫殿。但我认为，《西游记》在艺术上的最大成就，是成功地创造了孙悟空、猪八戒这两个不朽的艺术形象。孙悟空是《西游记》中第一主人公，是个非常了不起的英雄。他有无穷的本领，天不怕地不怕，具有不屈的反抗精神。他有着大英雄的不凡气度，也有爱听恭维话的缺点。他机智勇敢又诙谐好闹。而他最大的特点就是敢斗。与至高至尊的玉皇大帝敢斗，楞是叫响了\u201c齐天大圣\u201d的美名；与妖魔鬼怪敢斗，火眼金睛决不放过一个妖魔，如意金箍棒下决不对妖魔留情；与一切困难敢斗，决不退却低头。这就是孙悟空，一个光彩夺目的神话英雄。说到猪八戒，他的本事比孙悟空可差远了，更谈不上什么光辉高大，但这个形象同样刻画得非常好。猪八戒是一个喜剧形象，他憨厚老实，有力气，也敢与妖魔作斗争，是孙悟空第一得力助手。但他又满身毛病，如好吃，好占小便宜，好女色，怕困难，常常要打退堂鼓，心里老想着高老庄的媳妇；他有时爱撒个谎，可笨嘴拙腮的又说不圆；他还时不时地挑拨唐僧念紧箍咒，让孙悟空吃点苦头；他甚至还藏了点私房钱，塞在耳朵里。他的毛病实在多，这正是小私有者的恶习。作者对猪八戒缺点的批评是很严厉的，但又是善意的。他并不是一个被否定的人物，因此人们并不厌恶猪八戒，相反却感到十分真实可爱。唐僧的形象写得也不错，但比起孙悟空、猪八戒来，则要逊色得多。沙僧更是缺少鲜明的性格特点，这不能不说是《西游记》的缺憾。尽管如此，《西游记》在艺术上取得的成就仍是十分惊人的，孙悟空、猪八戒这两个形象，以其鲜明的个性特征，在中国文学史上立起了一座不朽的艺术丰碑。","price":"24.00元"},{"rating":{"max":10,"numRaters":672,"average":"9.4","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2004-6","tags":[{"count":157,"name":"四大名著","title":"四大名著"},{"count":96,"name":"小说","title":"小说"},{"count":69,"name":"吴承恩","title":"吴承恩"},{"count":65,"name":"中国古典","title":"中国古典"},{"count":62,"name":"古典文学","title":"古典文学"},{"count":55,"name":"中国文学","title":"中国文学"},{"count":55,"name":"中国古典文学","title":"中国古典文学"},{"count":39,"name":"明清章回小说","title":"明清章回小说"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s5716974.jpg","binding":"","translator":[],"catalog":"","pages":"688","images":{"small":"https://img3.doubanio.com/spic/s5716974.jpg","large":"https://img3.doubanio.com/lpic/s5716974.jpg","medium":"https://img3.doubanio.com/mpic/s5716974.jpg"},"alt":"https://book.douban.com/subject/1174703/","id":"1174703","publisher":"岳麓书社","isbn10":"780665402X","isbn13":"9787806654026","title":"西游记","url":"https://api.douban.com/v2/book/1174703","alt_title":"","author_intro":"","summary":"《西游记》主要描写的是孙悟空保唐僧西天取经，历经九九八十一难的故事。《西游记》全书一百回，从大的结构上看，可分成三个部分。第一回至第八回是第一部分，主要写了孙悟空出世、拜师、大闹天宫，这是全书最精彩的章节，热闹非凡，孙悟空上天入地好一顿折腾，将他的反抗性格表现得淋漓尽致。第八回至第十二回是第二部分，主要写了唐僧的出身及取经的缘由。第十三回至最后一回是第三部分，主要写唐僧西天取经，路上先后收了孙悟空、猪八戒、沙和尚三个徒弟，并历经九九八十一难，终于取到了真经，修成了正果。\n唐僧取经是历史上一件真实的事。大约距今一千三百多年前，即唐太宗贞观元年（627），年仅25岁的青年和尚玄奘离开京城长安，只身到天竺（印度）游学。他从长安出发后，途经中亚、阿富汗、巴基斯坦，历尽艰难险阻，最后到达了印度。他在那里学习了两年多，并在一次大型佛教经学辩论会任主讲，受到了赞誉。贞观十九年（645）玄奘回到了长安，带回佛经657部。他这次西天取经，前后十九年，行程几万里，是一次传奇式的万里长征，轰动一时。后来玄奘口述西行见闻，由弟子辩机辑录成《大唐西域记》十二卷。但这部书主要讲述了路上所见各国的历史、地理及交通，没有什么故事。及到他的弟子慧立、彦琮撰写的《大唐大慈恩寺三藏法师传》，则为玄奘的经历增添了许多神话色彩，从此，唐僧取经的故事便开始在民间广为流传。南宋有《大唐三藏取经诗话》，金代院本有《唐三藏》、《蟠桃会》等，元杂剧有吴昌龄的《唐三藏西天取经》、无名氏的《二郎神锁齐大圣》等，这些都为《西游记》的创作奠定了基础。吴承恩也正是在民间传说和话本、戏曲的基础上，经过艰苦的再创造，完成了这部令中华民族为之骄傲的伟大大文学巨著。吴承恩，字汝忠，号射阳山人，淮安府山阳（今江苏省淮安市）人。约生于明弘治十三年至正德初年之间（1500\u20141510），约卒于万历十年（1582）。吴承恩的曾祖父、祖父都是读书人，任过县学的训导、教谕。但到了他父亲吴锐这一辈，由于家贫困，出赘徐家，\u201c遂袭徐氏业，坐肆中\u201d，当起了小商人。尽管如此，吴家却不失读书的传统。据说其父吴锐虽为商人，不仅为人正派，而且好读书，好谈时政，这自然对吴承恩产生较大影响。吴承恩从小就很聪明，很早入了学，少年得志，名满乡里。天启《淮安府志》卷十六说吴承恩\u201c性敏而多慧，博极群书，为诗文，下笔立成。\u201d但成年后的吴承恩却很不顺利，在科举进身的道路上屡遭挫折，到四十多岁才补了一个岁贡生，五十多岁任过浙江长兴县丞，后又担任过荆王府纪善，这是同县丞级别差不多的闲职。吴承恩创作《西游记》大约是中年以后，或认为是晚年所作，具体时间无法确定。除《西游记》外，他还创作有长诗《二郎搜山图歌》和《禹鼎志》。现存《射阳先生存稿》四卷，包括诗一卷、散文三卷，是吴承恩逝世后由丘度编订而成。\n孙悟空那种不屈不挠的斗争精神，奋起金箍棒，横扫一切妖魔鬼怪的大无畏气概，反映了人民的愿望和要求。他代表了一种正义的力量，表现出人民战胜一切困难的必胜信念。又如取经路上遇到的那些妖魔，或是自然灾难的幻化，或是邪恶势力的象征。他们的贪婪、凶残、阴险和狡诈，也正是封建社会里的黑暗势力的特点。不仅如此，玉皇大帝统治的天宫、如来佛祖管辖的西方极乐世界，也都浓浓地涂上了人间社会的色彩。而作者对封建社会最高统治者的态度也颇可玩味，在《西游记》中，简直找不出一个称职的皇帝；至于昏聩无能的玉皇大帝、宠信妖怪的车迟国国王、要将小儿心肝当药引子的比丘国国王，则不是昏君就是暴君。对这些形象的刻画，即使是信手拈来，也无不具有很强的现实意义。孙悟空是《西游记》中第一主人公，是个非常了不起的英雄。他有无穷的本领，天不怕地不怕，具有不屈的反抗精神。他有着大英雄的不凡气度，也有爱听恭维话的缺点。他机智勇敢又诙谐好闹。而他最大的特点就是敢斗。与至高至尊的玉皇大帝敢斗，楞是叫响了\u201c齐天大圣\u201d的美名；与妖魔鬼怪敢斗，火眼金睛决不放过一个妖魔，如意金箍棒下决不对妖魔留情；与一切困难敢斗，决不退却低头。这就是孙悟空，一个光彩夺目的神话英雄。说到猪八戒，他的本事比孙悟空可差远了，更谈不上什么光辉高大，但这个形象同样刻画得非常好。\n猪八戒是一个喜剧形象，他憨厚老实，有力气，也敢与妖魔作斗争，是孙悟空第一得力助手。但他又满身毛病，如好吃，好占小便宜，好女色，怕困难，常常要打退堂鼓，心里老想着高老庄的媳妇；他有时爱撒个谎，可笨嘴拙腮的又说不圆；他还时不时地挑拨唐僧念紧箍咒，让孙悟空吃点苦头；他甚至还藏了点私房钱，塞在耳朵里。他的毛病实在多，这正是小私有者的恶习。作者对猪八戒缺点的批评是很严厉的，但又是善意的。他并不是一个被否定的人物，因此人们并不厌恶猪八戒，相反却感到十分真实可爱。唐僧的形象写得也不错，但比起孙悟空、猪八戒来，则要逊色得多。沙僧更是缺少鲜明的性格特点，这不能不说是《西游记》的缺憾。尽管如此，《西游记》在艺术上取得的成就仍是十分惊人的，孙悟空、猪八戒这两个形象，以其鲜明的个性特征，在中国文学史上立起了一座不朽的艺术丰碑。\n\n  点击链接进入新版： \n古典名著普及文库:西游记","price":"17.50元"},{"rating":{"max":10,"numRaters":323,"average":"9.0","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"1990-8-1","tags":[{"count":60,"name":"西游记","title":"西游记"},{"count":48,"name":"小说","title":"小说"},{"count":43,"name":"吴承恩","title":"吴承恩"},{"count":41,"name":"中国古典文学","title":"中国古典文学"},{"count":27,"name":"古典名著","title":"古典名著"},{"count":21,"name":"神话","title":"神话"},{"count":21,"name":"古典文学","title":"古典文学"},{"count":20,"name":"名著","title":"名著"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s9147753.jpg","binding":"精装","translator":[],"catalog":"第一回 灵根育孕源流出 心性修持大道生\n第二回 悟彻菩提真妙理 断魔归本合元神\n第三回 四海千山皆拱伏 九幽十类尽除名\n第四回 官封弼马心何足 名注齐天意未宁\n第五回 乱蟠桃大圣偷丹 反天宫诸神捉怪\n第六回 观音赴会问原因 小圣施威降大圣\n第七回 八卦炉中逃大圣 五行山下定心猿\n第八回 我佛造经传极乐 观音奉旨上长安\n......","pages":"752","images":{"small":"https://img3.doubanio.com/spic/s9147753.jpg","large":"https://img3.doubanio.com/lpic/s9147753.jpg","medium":"https://img3.doubanio.com/mpic/s9147753.jpg"},"alt":"https://book.douban.com/subject/1089886/","id":"1089886","publisher":"人民文学出版社","isbn10":"702001500X","isbn13":"9787020015009","title":"西游记","url":"https://api.douban.com/v2/book/1089886","alt_title":"","author_intro":"","summary":"《西游记》约成书于十六世纪七十年代我国明代中叶，它和比它先出现的《三国演义》、《水浒传》以及后来的《儒林外史》、《红楼梦》，都是我国明清时期最有代表性、最著名的长篇小说。它们的出现标志着中国古代小说艺术的光学成就，成为中国人民和世界人民所熟悉和喜爱的古典文学作品。\u2026\u2026","series":{"id":"22257","title":"四大名著人文社精装版"},"price":"34.00"},{"rating":{"max":10,"numRaters":98,"average":"9.3","min":0},"subtitle":"","author":["[明]吴承恩 著"],"pubdate":"2014-11","tags":[{"count":37,"name":"小说","title":"小说"},{"count":36,"name":"西游记","title":"西游记"},{"count":29,"name":"中华书局","title":"中华书局"},{"count":28,"name":"古典文学","title":"古典文学"},{"count":20,"name":"李飞天","title":"李飞天"},{"count":20,"name":"文学","title":"文学"},{"count":17,"name":"中国","title":"中国"},{"count":15,"name":"经典","title":"经典"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s27752715.jpg","binding":"平装","translator":["李天飞 校注"],"catalog":"","pages":"1283","images":{"small":"https://img3.doubanio.com/spic/s27752715.jpg","large":"https://img3.doubanio.com/lpic/s27752715.jpg","medium":"https://img3.doubanio.com/mpic/s27752715.jpg"},"alt":"https://book.douban.com/subject/26235478/","id":"26235478","publisher":"中华书局","isbn10":"7101104525","isbn13":"9787101104523","title":"西游记","url":"https://api.douban.com/v2/book/26235478","alt_title":"","author_intro":"李天飞，中华书局文学室编辑，北京大学文学硕士，专攻中国古典文献学和古典文学，专注于中国古典文学名著《西游记》的研究、整理。","summary":"作为四大名著之一的《西游记》，自成书以来，对其研究、整理代不乏人。本次校注《西游记》，以世德堂本为底本，参校本为杨闽斋本、朱鼎臣本、李卓吾评本、唐僧西游记、唐三藏出身全传、西游证道书和新说西游记等。就其中的思想、名物、典制、文化现象等加以详细注释：订正了工具书、旧注中的错误；采用各种途径，利用不同学科知识对小说中的疑难之处加以释读；充分利用历代研究成果，尽量搜集整理，并择善而从；对其中的宗教内容进行了尽可能详尽的探究。这个最新的注释本可以帮助现代读者深入了解和理解《西游记》这部生动的神魔小说。","series":{"id":"25942","title":"中华经典小说注释系列"},"price":"80.00"},{"rating":{"max":10,"numRaters":245,"average":"9.2","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"1991-10-1","tags":[{"count":51,"name":"小说","title":"小说"},{"count":48,"name":"西游记","title":"西游记"},{"count":37,"name":"中国古典文学","title":"中国古典文学"},{"count":35,"name":"古典","title":"古典"},{"count":31,"name":"吴承恩","title":"吴承恩"},{"count":20,"name":"中国文学","title":"中国文学"},{"count":16,"name":"上海古籍出版社","title":"上海古籍出版社"},{"count":13,"name":"中国古代文学","title":"中国古代文学"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s1154230.jpg","binding":"精装(无盘)","translator":[],"catalog":"第一回 灵根育孕源流出 心性修持大道生\n第二回 悟彻菩提真妙理 断魔归本合元神\n第三回 四海千山皆拱伏 九幽十类尽除名\n第四回 官封弼马心何足 名注齐天意未宁\n第五回 乱蟠桃大圣偷丹 反天宫诸神捉妖\n第六回 观音赴会问原因 小圣施威降大圣\n第七回 八卦炉中逃大圣 五行山下定心猿\n第八回 我佛造经传极乐 观音奉旨上长安\n第九回 袁守诚妙算无私曲 老龙王拙计犯天条\n第十回 二将军宫门镇鬼 唐太宗地府还魂","pages":"865","images":{"small":"https://img3.doubanio.com/spic/s1154230.jpg","large":"https://img3.doubanio.com/lpic/s1154230.jpg","medium":"https://img3.doubanio.com/mpic/s1154230.jpg"},"alt":"https://book.douban.com/subject/1213646/","id":"1213646","publisher":"上海古籍出版社","isbn10":"7532512002","isbn13":"9787532512003","title":"西游记","url":"https://api.douban.com/v2/book/1213646","alt_title":"","author_intro":"","summary":"西游记，ISBN：9787532512003，作者：（明）吴承恩著","series":{"id":"3933","title":"十大古典白话长篇小说"},"price":"19.30"},{"rating":{"max":10,"numRaters":264,"average":"8.9","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"1992-4-1","tags":[{"count":55,"name":"四大名著","title":"四大名著"},{"count":47,"name":"小说","title":"小说"},{"count":21,"name":"名著","title":"名著"},{"count":20,"name":"古典文学","title":"古典文学"},{"count":20,"name":"中国文学","title":"中国文学"},{"count":16,"name":"中国","title":"中国"},{"count":14,"name":"古典小说","title":"古典小说"},{"count":12,"name":"文学","title":"文学"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s8875457.jpg","binding":"精装","translator":[],"catalog":"第一回  灵根育孕源流出  心性修持大道生\n第二回  悟彻菩提真妙理  断魔归本合元神\n第三回  四海千山皆拱伏  九幽十类尽除名\n第四回  官封弼马心何足  名注齐天意未宁\n第五回  乱蟠桃大圣偷丹  反天宫诸神捉怪\n第六回  观音赴会问原因  小圣施威降大圣\n第七回  八卦炉中逃大圣  五行山下定心猿\n第八回  我佛造经传极乐  观音奉旨上长安\n第九回  陈光蕊赴任逢灾  江流僧复仇报本\n第十回  老龙王拙计犯天条  魏丞相遗书托冥吏\n第十一回  游地府太宗还魂  进瓜果刘全续配\n第十二回  唐王秉诚修大会  观音显像化金蝉\n第十三回  陷虎穴金星解厄  双叉岭伯钦留僧\n第十四回  心猿归正  六贼无踪\n第十五回  蛇盘山诸神暗佑  鹰愁涧意马收缰\n第十六回  观音院僧谋宝贝  黑风山怪窃袈裟\n第十七回  孙行者大闹黑风山  观世音收伏熊罴怪\n\u2026\u2026","pages":"772","images":{"small":"https://img1.doubanio.com/spic/s8875457.jpg","large":"https://img1.doubanio.com/lpic/s8875457.jpg","medium":"https://img1.doubanio.com/mpic/s8875457.jpg"},"alt":"https://book.douban.com/subject/1201945/","id":"1201945","publisher":"三秦出版社","isbn10":"7805464057","isbn13":"9787805464053","title":"西游记","url":"https://api.douban.com/v2/book/1201945","alt_title":"","author_intro":"","summary":"本书是我国四大古典名著之一，书中描写了孙悟空、猪八戒、沙和尚保护唐僧师父去西天取经的故事，师徒四人一路餐风饮露，经历千难万险，斗魔除怪，经过九九八十一难后，终于到达西天极乐佛祖处取回了真经，修成了正果。","price":"15.00"},{"rating":{"max":10,"numRaters":202,"average":"9.1","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2007-1","tags":[{"count":30,"name":"小说","title":"小说"},{"count":29,"name":"西游记","title":"西游记"},{"count":24,"name":"古典名著","title":"古典名著"},{"count":22,"name":"中国古典文学","title":"中国古典文学"},{"count":14,"name":"经典","title":"经典"},{"count":13,"name":"文学","title":"文学"},{"count":11,"name":"古典","title":"古典"},{"count":10,"name":"中国文学","title":"中国文学"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s6787735.jpg","binding":"简裝本","translator":[],"catalog":"第一回  灵根育孕源流出  心性修持大道生第二回  悟彻菩提真妙理  断魔归本合元神第三回  四海千山皆拱伏  九幽十类尽除名第四回  官封弼马心何足  名注齐天意未宁第五回  乱蟠桃大圣偷丹  反天宫诸神捉怪第六回  观音赴会问原因  小圣施威降大圣第七回  八卦炉中逃大圣  五行山下定心猿第八回  我佛造经传极乐  观音奉旨上长安附录  陈光蕊赴任逢灾  江流僧复仇报本第九回  袁守诚妙算无私曲  老龙王拙计犯天条第十回  二将军宫门镇鬼  唐太宗地府还魂第十一回  还受生唐王遵善果  度孤魂萧瑀正空门第十二回  玄奘秉诚建大会  观音显象化金蝉第十三回  陷虎穴金星解厄  双叉岭伯钦留僧第十四回  心  猿  归  正  六  贼  无  踪第十五回  蛇盘山诸神暗佑  鹰愁涧意马收缰第十六回  观音院僧谋宝贝  黑风山怪窃袈裟第十七回  孙行者大闹黑风山  观世音收伏熊罴怪第十八回  观音院唐僧脱难  高老庄大圣除魔第十九回  云栈洞悟空收八戒  浮屠山玄奘受心经第二十回  黄风岭唐僧有难  半山中八戒争先第二十一回  护法设庄留大圣  须弥灵吉定风魔第二十二回  八戒大战流沙河  木叉奉法收悟净第二十三回  三藏不忘本  四圣试禅心第二十四回  万寿山大仙留故友  五庄观行者窃人参第二十五回  镇元仙赶捉取经僧  孙行者大闹五庄观第二十六回  孙悟空三岛求方  观世音甘泉活树第二十七回  尸魔三戏唐三藏  圣僧恨逐美猴王第二十八回  花果山群妖聚义  黑松林三藏逢魔第二十九回  脱难江流来国土  承恩八戒转山林第三十回  邪魔侵正法  意马忆心猿第三十一回  猪八戒义激猴王  孙行者智降妖怪第三十二回  平顶山功曹传信  莲花洞木母逢灾第三十三回  外道迷真性  元神助本心第三十四回  魔王巧算困心猿  大圣腾挪骗宝贝第三十五回  外道施威欺正性  心猿获宝伏邪魔第三十六回  心猿正处诸缘伏  劈破傍门见月明第三十七回  鬼王夜谒唐三藏  悟空神化引婴儿第三十八回  婴儿问母知邪正  金木参玄见假真第三十九回  一粒金丹天上得  三年故主世间生第四十回  婴儿戏化禅心乱  猿马刀归木母空第四十一回  心猿遭火败  木母被魔擒第四十二回  大圣殷勤拜南海  观音慈善缚红孩第四十三回  黑河妖孽擒僧去  西洋龙子捉鼍回第四十四回  法身元运逢车力  心正妖邪度脊关第四十五回  三清观大圣留名  车迟国猴王显法第四十六回  外道弄强欺正法  心猿显圣灭诸邪第四十七回  圣僧夜阻通天水  金木垂慈救小童第四十八回  魔弄寒风飘大雪  僧思拜佛履层冰第四十九回  三藏有灾沉水宅  观音救难现鱼篮第五十回  情乱性从因爱欲  神昏心动遇魔头第五十一回  心猿空用千般计  水火无功难炼魔第五十二回  悟帝大闹金蛲洞  如来暗示主人公第五十三回  禅主吞餐怀鬼孕  黄婆运水解邪胎第五十四回  法性西来逢女国  心猿定计脱烟花第五十五回  色邪淫戏唐三藏  性正修持不坏身第五十六回  神狂诛草寇  道昧放心猿第五十七回  真行者落伽山诉苦  假猴王水帘洞誊文第五十八回  二心搅乱大乾坤  一体难修真寂灭第五十九回  唐三藏路阻火焰山  孙行者一调芭蕉扇第六十回  牛魔王罢战赴华筵  孙行者二调芭蕉扇第六十一回  猪八戒助力败魔王  孙行者三调芭蕉扇第六十二回  涤垢洗心惟扫塔  缚魔归正乃修身第六十三回  二僧荡怪闹龙宫  群圣除邪获宝贝第六十四回  荆刺岭悟能努力  水仙庵三藏谈诗第六十五回  妖邪假设小雷音  四众皆遭大厄难第六十六回  诸神遭毒手  弥勒缚妖魔第六十七回  拯救驼罗禅性稳  脱离秽污道心清第六十八回  朱紫国唐僧论前世  孙行者施为三折肱第六十九回  心主夜间修药物  君王筵上论妖邪第七十回  妖魔宝放烟沙火  悟空计盗紫金铃第七十一回  行者假名降怪犼  观音现象伏妖王第七十二回  盘丝洞七情迷本  濯垢泉八戒忘形第七十三回  情因旧恨生灾毒  心主遭魔幸破光第七十四回  长庚传报魔头狠  行者施为变化能第七十五回  心猿钻透阴阳窍  魔王还归大道真第七十六回  心神居舍魔归性  木母同降怪体真第七十七回  群魔欺本性  一体拜真如第七十八回  比丘怜子遣阴神  金殿识魔谈道德第七十九回  寻洞擒妖逢老寿  当朝正主救婴儿第八十回  姹女育阳求配偶  心猿护主识妖邪第八十一回  镇海寺心猿知怪  黑松林三众寻师第八十二回  姹  女  求  阳  元  神  护  道第八十三回  心猿识得丹头  姹女还归本性第八十四回  难灭伽持圆大觉  法王成正体天然第八十五回  心猿妒木母  魔主计吞禅第八十六回  木母助威征怪物  金公施法灭妖邪第八十七回  风仙郡冒天止雨  孙大圣劝善施霖第八十八回  禅到玉华施法会  心猿木母授门人第八十九回  黄狮精虚设钉钯宴  金木土计闹豹头山第九十回  师狮授受同归一  盗道缠禅静九灵第九十一回  金平府元夜观灯  玄英洞唐僧供状第九十二回  三僧大战青龙山  四星挟捉犀牛怪第九十三回  给孤园问古谈因  天竺国朝王遇偶第九十四回  四僧宴乐御花园  一怪空怀情欲喜第九十五回  假合真形擒玉兔  真阴归正会灵元第九十六回  寇员外喜待高僧  唐长老不贪富贵第九十七回  金酬外护遭魔蛰  圣显幽魂救本原第九十八回  猿熟马驯方脱壳  功成行满见真如第九十九回  九九数完魔灭尽  三三行满道归根第一百回  径回东土  五圣成真","pages":"906","images":{"small":"https://img3.doubanio.com/spic/s6787735.jpg","large":"https://img3.doubanio.com/lpic/s6787735.jpg","medium":"https://img3.doubanio.com/mpic/s6787735.jpg"},"alt":"https://book.douban.com/subject/1925246/","id":"1925246","publisher":"华夏出版社","isbn10":"7508040090","isbn13":"9787508040097","title":"西游记","url":"https://api.douban.com/v2/book/1925246","alt_title":"","author_intro":"","summary":"《中国古典文学名著丛书:西游记》是我国古代文学四大名著之一。它主要取材于唐朝太宗时期，著名僧人唐玄奘受皇命上当时的天竺，即现在的印度，去取佛经。本小说以丰富瑰奇的想像描写了师徒四人在崎岖漫长的西方取经途中和穷山恶水斗争的历程，并将所经历的千难万险形象化为妖魔鬼怪所设置的八十一难，以动物幻化的有情山精树怪，生动地表现了无情的山川险阻，并以降妖服怪赞颂了取经人排除艰难的战斗精神，小说大唱人定战胜自然的凯歌。在中国古代小说中，《西游记》是一部思想性和艺术性都臻于第一流的伟大作品。它也是明代长篇小说的重要流派之一神魔小说的代表作，是中国古代神魔小说的翘楚、浪漫文学的代表，作者以其丰富的艺术想象力建构了一个光怪陆离的神话世界，并塑造出以孙悟空、猪八戒为代表的一批性格鲜明、影响深远的文学形象，数百年来一直为人们所喜闻乐见。","series":{"id":"409","title":"中国古典文学名著丛书"},"price":"18.00元"},{"rating":{"max":10,"numRaters":146,"average":"9.4","min":0},"subtitle":"图文本","author":["（明）吴承恩"],"pubdate":"2004-07","tags":[{"count":37,"name":"古典文学","title":"古典文学"},{"count":29,"name":"西游记","title":"西游记"},{"count":19,"name":"中国文学","title":"中国文学"},{"count":13,"name":"四大名著","title":"四大名著"},{"count":12,"name":"中国古典","title":"中国古典"},{"count":11,"name":"小说","title":"小说"},{"count":10,"name":"文学名著","title":"文学名著"},{"count":9,"name":"中国","title":"中国"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s1065653.jpg","binding":"精装","translator":[],"catalog":"第一回 灵根育孕源流出 心性修持大道生第二回 悟彻菩提真妙理 断魔归本合元神第三回 四海千山皆拱伏 九幽十类尽除名第四回 官封弼马心何足 名注齐天意未宁第五回 乱蟠桃大圣偷丹 反天宫诸神捉怪第六回 观音赴会问原因 小圣施威降大圣第七回 八卦炉中逃大圣 五行山下定心猿第八回 我佛造经传极乐 观音奉旨上长安第九回 袁守诚妙算无私曲 老龙王拙计犯天条第十回 二将军宫门镇鬼 唐太宗地府还魂第十一回 还受生唐王遵善果 度孤魂萧瑀正空门第十二回 玄奘秉诚建大会 观音显象化金蝉第十三回 陷虎穴金星解厄 双叉岭伯钦留僧第十四回 心猿归正 六贼无踪第十五回 蛇盘山诸神暗佑 鹰愁涧意马收缰第十六回 观音院僧谋宝贝 黑风山怪窃袈裟第十七回 孙行者大闹黑风山 观世音收伏熊罴怪第十八回 观音院唐僧脱难 高老庄大圣除魔第十九回 云栈洞悟空收八戒 浮屠山玄奘受心经第二十回 黄风岭唐僧有难 半山中八戒争先第二十一回 护法设庄留大圣 须弥灵吉定风魔第二十二回 八戒大战流沙河 木叉奉法收悟净第二十三回 三藏不忘本 四圣试禅心第二十四回 万寿山大仙留故友 五庄观行者窃人参第二十五回 镇元仙赶捉取经僧 孙行者大闹五庄观第二十六回 孙悟空三岛求方 观世音甘泉活树第二十七回 尸魔三戏唐三藏 圣僧恨逐美猴王第二十八回 花果山群妖聚义 黑松林三藏逢魔第二十九回 脱难江流来国土 承恩八戒转山林第三十回 邪魔侵正法 意马忆心猿第三十一回 猪八戒义激猴王 孙行者智降妖怪第三十二回 平顶山功曹传信 莲花洞木母逢灾第三十三回 外道迷真性 元神助本心第三十四回 魔王巧算困心猿 大圣腾挪骗宝贝第三十五回 外道施威欺正性 心猿获宝伏邪魔第三十六回 心猿正处诸缘伏 劈破傍门见月明第三十七回 鬼王夜谒唐三藏 悟空神化引婴儿第三十八回 婴儿问母知邪正 金木参玄见假真第三十九回 一粒金丹天上得 三年故主世间生第四十回 婴儿戏化禅心乱 猿马刀归木母空第四十一回 心猿遭火败 木母被魔擒第四十二回 大圣殷勤拜南海 观音慈善缚红孩第四十三回 黑河妖孽擒僧去 西洋龙子捉鼍回第四十四回 法身元运逢车力 心正妖邪度脊关第四十五回 三清观大圣留名 车迟国猴王显法第四十六回 外道弄强欺正法 心猿显圣灭诸邪第四十七回 圣僧夜阻通天水 金木垂慈救小童第四十八回 魔弄寒风飘大雪 僧思拜佛履层冰第四十九回 三藏有灾沉水宅 观音救难现鱼篮第五十回 情乱性从因爱欲 神昏心动遇魔头第五十一回 心猿空用千般计 水火无功难炼魔第五十二回 悟帝大闹金蛲洞 如来暗示主人公第五十三回 禅主吞餐怀鬼孕 黄婆运水解邪胎第五十四回 法性西来逢女国 心猿定计脱烟花第五十五回 色邪淫戏唐三藏 性正修持不坏身第五十六回 神狂诛草寇 道昧放心猿第五十七回 真行者落伽山诉苦 假猴王水帘洞誊文第五十八回 二心搅乱大乾坤 一体难修真寂灭第五十九回 唐三藏路阻火焰山 孙行者一调芭蕉扇第六十回 牛魔王罢战赴华筵 孙行者二调芭蕉扇第六十一回 猪八戒助力败魔王 孙行者三调芭蕉扇第六十二回 涤垢洗心惟扫塔 缚魔归正乃修身第六十三回 二僧荡怪闹龙宫 群圣除邪获宝贝第六十四回 荆刺岭悟能努力 水仙庵三藏谈诗第六十五回 妖邪假设小雷音 四众皆遭大厄难第六十六回 诸神遭毒手 弥勒缚妖魔第六十七回 拯救驼罗禅性稳 脱离秽污道心清第六十八回 朱紫国唐僧论前世 孙行者施为三折肱第六十九回 心主夜间修药物 君王筵上论妖邪第七十回 妖魔宝放烟沙火 悟空计盗紫金铃第七十一回 行者假名降怪犼 观音现象伏妖王第七十二回 盘丝洞七情迷本 濯垢泉八戒忘形第七十三回 情因旧恨生灾毒 心主遭魔幸破光第七十四回 长庚传报魔头狠 行者施为变化能第七十五回 心猿钻透阴阳窍 魔王还归大道真第七十六回 心神居舍魔归性 木母同降怪体真第七十七回 群魔欺本性 一体拜真如第七十八回 比丘怜子遣阴神 金殿识魔谈道德第七十九回 寻洞擒妖逢老寿 当朝正主救婴儿第八十回 姹女育阳求配偶 心猿护主识妖邪第八十一回 镇海寺心猿知怪 黑松林三众寻师第八十二回 姹女求阳 元神护道第八十三回 心猿识得丹头 姹女还归本性第八十四回 难灭伽持圆大觉 法王成正体天然第八十五回 心猿妒木母 魔主计吞禅第八十六回 木母助威征怪物 金公施法灭妖邪第八十七回 风仙郡冒天止雨 孙大圣劝善施霖第八十八回 禅到玉华施法会 心猿木母授门人第八十九回 黄狮精虚设钉钯宴 金木土计闹豹头山第九十回 师狮授受同归一 盗道缠禅静九灵第九十一回 金平府元夜观灯 玄英洞唐僧供状第九十二回 三僧大战青龙山 四星挟捉犀牛怪第九十三回 给孤园问古谈因 天竺国朝王遇偶第九十四回 四僧宴乐御花园 一怪空怀情欲喜第九十五回 假合真形擒玉兔 真阴归正会灵元第九十六回 寇员外喜待高僧 唐长老不贪富贵第九十七回 金酬外护遭魔蛰 圣显幽魂救本原第九十八回 猿熟马驯方脱壳 功成行满见真如第九十九回 九九数完魔灭尽 三三行满道归根第一百回 径回东土 五圣成真","pages":"775","images":{"small":"https://img3.doubanio.com/spic/s1065653.jpg","large":"https://img3.doubanio.com/lpic/s1065653.jpg","medium":"https://img3.doubanio.com/mpic/s1065653.jpg"},"alt":"https://book.douban.com/subject/1080401/","id":"1080401","publisher":"上海古籍出版社","isbn10":"7532537234","isbn13":"9787532537235","title":"西游记","url":"https://api.douban.com/v2/book/1080401","alt_title":"","author_intro":"","summary":"西游故事自宋迄元在民间心话本、戏曲等形式广泛流传，吴承恩正是在大量民间文艺的基础上，再创作了中国小说史上的这一巨著。小说中的主角已从唐僧让位于孙悟空，在大闹天宫与历史八下一年难西行取经的情节中，鲜明地表现了民众骊勇敢、机智、坚韧不拔等品质的礼赞。","price":"58.50元"},{"rating":{"max":10,"numRaters":111,"average":"9.2","min":0},"subtitle":"","author":["吴承恩著","黄周星点评"],"pubdate":"2009-06","tags":[{"count":39,"name":"古典文学","title":"古典文学"},{"count":27,"name":"四大名著","title":"四大名著"},{"count":16,"name":"小说","title":"小说"},{"count":11,"name":"吴承恩","title":"吴承恩"},{"count":10,"name":"中国古典文学","title":"中国古典文学"},{"count":9,"name":"中国","title":"中国"},{"count":7,"name":"名著","title":"名著"},{"count":7,"name":"古典","title":"古典"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s3888779.jpg","binding":"平装","translator":["黄周星 注解"],"catalog":"","pages":"488","images":{"small":"https://img1.doubanio.com/spic/s3888779.jpg","large":"https://img1.doubanio.com/lpic/s3888779.jpg","medium":"https://img1.doubanio.com/mpic/s3888779.jpg"},"alt":"https://book.douban.com/subject/3810700/","id":"3810700","publisher":"中华书局","isbn10":"7101066496","isbn13":"9787101066494","title":"西游记","url":"https://api.douban.com/v2/book/3810700","alt_title":"","author_intro":"黄周星：明清之际著名的文学家和戏曲作家。他对《西游记》的评点自成体系，具有深刻的洞察力，给读者极大的启发，揭示了《西游记》中儒、释、道三教同源的核心思想。","summary":"《西游记》被誉为中国神怪小说的巅峰之作，它叙述孙悟空、猪八戒、沙和尚保护唐三藏去西天取经，历经八十一难，取回真经，修成正果的故事。《西游记》以唐代贞观年间玄奘赴西天取经的事件为原型进行创作。玄奘西行十七年，游历西域五十多个国家，回到长安，带回佛经六百五十七部。这一佛教史上的空前壮举，玄奘所经历的种种艰难困苦和奇幻遭遇，便成为民间文艺创作的源泉。宋元两代，取经故事在戏曲舞台上大量演出，在说书场上被反复传颂，在寺窟壁画中时有展现，也成为以后文人进行小说创作的素材来源。\n著名学者黄周星和书商汪象旭合作，对百回本的《西游记》做了一番润饰修改，推出了黄周星定本《西游证道书》，这是《西游记》演化成书后最为成熟，同时也是流传最广的一个本子。\n黄周星的点评自成体系，他所要阐发的是一种释、道同源，以致儒、释、道三教同源的理论。《西游证道书》的\u201c证道\u201d则是对这套理论做进一步的阐说和发挥。是以道教中全真教的教义为基础，又旁通于佛教的的禅宗和儒家的理学，是一种儒、释、道三教同源思想的体现。以\u201c憺漪子\u201d名义进行的回前评，是黄星周对仙佛同源理论的较为系统的阐述，黄周星的点评独到精彩，有时寥寥几字，却让人印象深刻，激赏其深刻的洞察力。相信这部书会提升读者的阅读体验。\n简体横排，双色印刷","series":{"id":"1321","title":"四大名著名家点评"},"price":"46.00元"},{"rating":{"max":10,"numRaters":112,"average":"9.2","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2001-9","tags":[{"count":26,"name":"小说","title":"小说"},{"count":21,"name":"古典文学","title":"古典文学"},{"count":12,"name":"西游记","title":"西游记"},{"count":12,"name":"吴承恩","title":"吴承恩"},{"count":8,"name":"中国文学","title":"中国文学"},{"count":8,"name":"中国古典文学","title":"中国古典文学"},{"count":6,"name":"经典","title":"经典"},{"count":6,"name":"古典","title":"古典"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s1280353.jpg","binding":"精装(无盘)","translator":[],"catalog":"第一回 灵根育孕源流出 心性修持大道生\n第二回 悟彻菩提真妙理 断魔归本合元神\n第三回 四海千山皆拱伏 九幽十类尽除名\n第四回 官封弼马心何足 名注齐天意未宁\n第五回 乱蟋桃大圣偷丹 反天宫诸神捉怪\n第六回 观音赴会问原因 小圣施威降大圣\n第七回 八卦炉中逃大圣 五行山下定心猿\n第八回 我佛造经传极乐 观音奉旨上长安\n附录 陈光蕊赴任逢灾 江流僧复仇报本\n第九回 袁守诚妙算无私曲 老龙王拙计犯天条\n第十回 二将军宫门镇鬼 唐太宗地府还魂","pages":"688","images":{"small":"https://img3.doubanio.com/spic/s1280353.jpg","large":"https://img3.doubanio.com/lpic/s1280353.jpg","medium":"https://img3.doubanio.com/mpic/s1280353.jpg"},"alt":"https://book.douban.com/subject/1093094/","id":"1093094","publisher":"岳麓书社","isbn10":"7806651071","isbn13":"9787806651070","title":"西游记","url":"https://api.douban.com/v2/book/1093094","alt_title":"","author_intro":"","summary":"《西游记》产生于十六世纪的中国明朝嘉靖公元1522\u20141566)时期，距今已四百多年了。作者吴承恩，字汝忠，号射阳居士，《西游记》是吴承恩中年时期写成初稿，后来经过润饰而成的。他在前代多年积累下来并在民间流传的有关唐僧取经的文学作品和故事的基础上进行艺术再创造，并且把原来的以唐僧取经为主的故事，改为孙悟空为主的战天斗地史。\n孙悟空是全书中最光辉的形象。\u201c大闹天宫\u201d突出他热爱自由、勇于反抗的精神\u201c西天取经\u201d表现他见恶必除、除恶必尽的精神。孙悟空大闹天宫失败后，经过五行山下五百年的镇压，被唐僧放出，同往西天。他已不再是一个叛逆者的形象，而是一个头戴紧箍，身穿虎皮裙，专为人间解除魔难的英雄。在重重困难之前顽强不屈，随机应机，就是镇魔者孙悟空的主要特征。\n《西游记》描写的幻想世界和神话人物，大都有现实生活作基础，同时在神奇的形态下体现了作家与人民的某些美好愿望。八十一难、七十二变、各种神魔的本领都充满幻想色彩；五花八门、奇光异彩的宝贝，显然是人们为了征服自然或战胜敌人才假想出来的。《西游记》 构成了浪漫主义的基本艺术特征。\n《西游记》把善意的嘲笑、辛辣的讽刺和严峻的批判艺术地结合起来，使不少章回妙趣横生，完满地表达了深刻的思想内容和作者的鲜明爱憎。九九八十一难所包含的四十一个小故事也都通过僧徒、神佛、妖魔间的错综关系表现出来，一波未平一波又起。在这无数充满斗争的幻想情节中，意味深长地寄寓了广大人民反抗恶势力，要求战胜自然、困难的乐观精神，曲折地反映了封建时代的社会现实。","price":"15.50元"},{"rating":{"max":10,"numRaters":36,"average":"8.9","min":0},"subtitle":"黄周星定本西游证道书","author":["黄永年点校"],"pubdate":"1993","tags":[{"count":15,"name":"西游记","title":"西游记"},{"count":11,"name":"黄永年","title":"黄永年"},{"count":8,"name":"批本","title":"批本"},{"count":8,"name":"古典文学","title":"古典文学"},{"count":6,"name":"中华书局","title":"中华书局"},{"count":5,"name":"中国文学","title":"中国文学"},{"count":4,"name":"小说","title":"小说"},{"count":3,"name":"1993","title":"1993"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s3135290.jpg","binding":"32开","translator":[],"catalog":"","pages":"900","images":{"small":"https://img3.doubanio.com/spic/s3135290.jpg","large":"https://img3.doubanio.com/lpic/s3135290.jpg","medium":"https://img3.doubanio.com/mpic/s3135290.jpg"},"alt":"https://book.douban.com/subject/3105143/","id":"3105143","publisher":"中华书局","isbn10":"7101009239","isbn13":"9787101009231","title":"西游记","url":"https://api.douban.com/v2/book/3105143","alt_title":"","author_intro":"","summary":"","price":"34元"},{"rating":{"max":10,"numRaters":39,"average":"7.6","min":0},"subtitle":"","author":["沈有乾"],"pubdate":"1998-12","tags":[{"count":9,"name":"沈有乾","title":"沈有乾"},{"count":6,"name":"万有文库","title":"万有文库"},{"count":5,"name":"新世纪万有文库","title":"新世纪万有文库"},{"count":3,"name":"随笔","title":"随笔"},{"count":3,"name":"中国","title":"中国"},{"count":2,"name":"社会学","title":"社会学"},{"count":2,"name":"游记","title":"游记"},{"count":1,"name":"齐·新世纪万有文库（辽宁教育出版社）","title":"齐·新世纪万有文库（辽宁教育出版社）"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s3574320.jpg","binding":"平装","translator":[],"catalog":"1.目录本书说明序（一）定名（二）宗旨（三）资格（四）准备（五）选科（六）择校（七）治装（八）船上（九）沿途（十）登陆（十一）到校（十二）士大（十三）备制（十四）膳宿（十五）费用（十六）插班（十七）上课<br/\n","pages":"99","images":{"small":"https://img3.doubanio.com/spic/s3574320.jpg","large":"https://img3.doubanio.com/lpic/s3574320.jpg","medium":"https://img3.doubanio.com/mpic/s3574320.jpg"},"alt":"https://book.douban.com/subject/1053240/","id":"1053240","publisher":"辽宁教育出版社","isbn10":"7538250980","isbn13":"9787538250985","title":"西游记","url":"https://api.douban.com/v2/book/1053240","alt_title":"","author_intro":"","summary":"本书收录了作者1998年至今所写的12篇文章。这些文章（包括所收的几篇附录）曾经备受争议。涉及\u201c全球化\u201d的三篇时事评论将我们引入1997年的亚洲金融危机、1999年北约轰炸中国驻南大使馆和今天跌宕起伏的有关知识经济命运的激烈讨论之中。这三篇评论贯穿了一贯的观点：资本主义是附着在当代世界的现代化、市场进程和民族国家中的破坏性力量。","series":{"id":"5007","title":"新世纪万有文库·近世文化书系"},"price":"3.70"},{"rating":{"max":10,"numRaters":98,"average":"9.0","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2006-7","tags":[{"count":22,"name":"四大名著","title":"四大名著"},{"count":15,"name":"中国古典","title":"中国古典"},{"count":11,"name":"小说","title":"小说"},{"count":9,"name":"吴承恩","title":"吴承恩"},{"count":8,"name":"名著","title":"名著"},{"count":8,"name":"中国","title":"中国"},{"count":7,"name":"中国古典文学","title":"中国古典文学"},{"count":4,"name":"古典文学","title":"古典文学"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s10428290.jpg","binding":"平装","translator":[],"catalog":"第一回  灵根育孕源流出  心性修持大道生第二回  悟彻菩提真妙理  断魔归本合元神第三回  四海千山皆拱伏  九幽十类尽除名第四回  官封弼马心何足  名注齐天意未宁第五回  乱蟠桃大圣偷丹  反天宫诸神捉怪第六回  观音赴会问原因  小圣施威降大圣第七回  八卦炉中逃大圣  五行山下定心猿第八回  我佛造经传极乐  观音奉旨上长安第九回  袁守诚妙算无私曲  老龙王拙计犯天条第十回  二将军宫门镇鬼  唐太宗地府还魂第十一回  还受生唐王遵善果  度孤魂萧瑀正空门第十二回  玄奘秉诚建大会  观音显象化金蝉第十三回  陷虎穴金星解厄  双叉岭伯钦留僧第十四回  心猿归正  六贼无踪第十五回  蛇盘山诸神暗佑  鹰愁涧意马收缰第十六回  观音院僧谋宝贝  黑风山怪窃袈裟第十七回  孙行者大闹黑风山  观世音收伏熊罴怪第十八回  观音院唐僧脱难  高老庄大圣除魔第十九回  云栈洞悟空收八戒  浮屠山玄奘受心经第二十回  黄风岭唐僧有难  半山中八戒争先第二十一回  护法设庄留大圣  须弥灵吉定风魔第二十二回  八戒大战流沙河  木叉奉法收悟净第二十三回  三藏不忘本  四圣试禅心第二十四回  万寿山大仙留故友  五庄观行者窃人参第二十五回  镇元仙赶捉取经僧  孙行者大闹五庄观第二十六回  孙悟空三岛求方  观世音甘泉活树第二十七回  尸魔三戏唐三藏  圣僧恨逐美猴王第二十八回  花果山群妖聚义  黑松林三藏逢魔第二十九回  脱难江流来国土  承恩八戒转山林第三十回  邪魔侵正法  意马忆心猿第三十一回  猪八戒义激猴王  孙行者智降妖怪第三十二回  平顶山功曹传信  莲花洞木母逢灾第三十三回  外道迷真性  元神助本心第三十四回  魔王巧算困心猿  大圣腾挪骗宝贝第三十五回  外道施威欺正性  心猿获宝伏邪魔第三十六回  心猿正处诸缘伏  劈破傍门见月明第三十七回  鬼王夜谒唐三藏  悟空神化引婴儿第三十八回  婴儿问母知邪正  金木参玄见假真第三十九回  一粒金丹天上得  三年故主世间生第四十回  婴儿戏化禅心乱  猿马刀归木母空第四十一回  心猿遭火败  木母被魔擒第四十二回  大圣殷勤拜南海  观音慈善缚红孩第四十三回  黑河妖孽擒僧去  西洋龙子捉鼍回第四十四回  法身元运逢车力  心正妖邪度脊关第四十五回  三清观大圣留名  车迟国猴王显法第四十六回  外道弄强欺正法  心猿显圣灭诸邪第四十七回  圣僧夜阻通天水  金木垂慈救小童第四十八回  魔弄寒风飘大雪  僧思拜佛履层冰第四十九回  三藏有灾沉水宅  观音救难现鱼篮第五十回  情乱性从因爱欲  神昏心动遇魔头第五十一回  心猿空用千般计  水火无功难炼魔第五十二回  悟帝大闹金蛲洞  如来暗示主人公第五十三回  禅主吞餐怀鬼孕  黄婆运水解邪胎第五十四回  法性西来逢女国  心猿定计脱烟花第五十五回  色邪淫戏唐三藏  性正修持不坏身第五十六回  神狂诛草寇  道昧放心猿第五十七回  真行者落伽山诉苦  假猴王水帘洞誊文第五十八回  二心搅乱大乾坤  一体难修真寂灭第五十九回  唐三藏路阻火焰山  孙行者一调芭蕉扇第六十回  牛魔王罢战赴华筵  孙行者二调芭蕉扇第六十一回  猪八戒助力败魔王  孙行者三调芭蕉扇第六十二回  涤垢洗心惟扫塔  缚魔归正乃修身第六十三回  二僧荡怪闹龙宫  群圣除邪获宝贝第六十四回  荆刺岭悟能努力  水仙庵三藏谈诗第六十五回  妖邪假设小雷音  四众皆遭大厄难第六十六回  诸神遭毒手  弥勒缚妖魔第六十七回  拯救驼罗禅性稳  脱离秽污道心清第六十八回  朱紫国唐僧论前世  孙行者施为三折肱第六十九回  心主夜间修药物  君王筵上论妖邪第七十回  妖魔宝放烟沙火  悟空计盗紫金铃第七十一回  行者假名降怪犼  观音现象伏妖王第七十二回  盘丝洞七情迷本  濯垢泉八戒忘形第七十三回  情因旧恨生灾毒  心主遭魔幸破光第七十四回  长庚传报魔头狠  行者施为变化能第七十五回  心猿钻透阴阳窍  魔王还归大道真第七十六回  心神居舍魔归性  木母同降怪体真第七十七回  群魔欺本性  一体拜真如第七十八回  比丘怜子遣阴神  金殿识魔谈道德第七十九回  寻洞擒妖逢老寿  当朝正主救婴儿第八十回  姹女育阳求配偶  心猿护主识妖邪第八十一回  镇海寺心猿知怪  黑松林三众寻师第八十二回  姹女求阳  元神护道第八十三回  心猿识得丹头  姹女还归本性第八十四回  难灭伽持圆大觉  法王成正体天然第八十五回  心猿妒木母  魔主计吞禅第八十六回  木母助威征怪物  金公施法灭妖邪第八十七回  风仙郡冒天止雨  孙大圣劝善施霖第八十八回  禅到玉华施法会  心猿木母授门人第八十九回  黄狮精虚设钉钯宴  金木土计闹豹头山第九十回  师狮授受同归一  盗道缠禅静九灵第九十一回  金平府元夜观灯  玄英洞唐僧供状第九十二回  三僧大战青龙山  四星挟捉犀牛怪第九十三回  给孤园问古谈因  天竺国朝王遇偶第九十四回  四僧宴乐御花园  一怪空怀情欲喜第九十五回  假合真形擒玉兔  真阴归正会灵元第九十六回  寇员外喜待高僧  唐长老不贪富贵第九十七回  金酬外护遭魔蛰  圣显幽魂救本原第九十八回  猿熟马驯方脱壳  功成行满见真如第九十九回  九九数完魔灭尽  三三行满道归根第一百回  径回东土  五圣成真","pages":"383","images":{"small":"https://img3.doubanio.com/spic/s10428290.jpg","large":"https://img3.doubanio.com/lpic/s10428290.jpg","medium":"https://img3.doubanio.com/mpic/s10428290.jpg"},"alt":"https://book.douban.com/subject/1881674/","id":"1881674","publisher":"北京出版社","isbn10":"7200065064","isbn13":"9787200065060","title":"西游记","url":"https://api.douban.com/v2/book/1881674","alt_title":"","author_intro":"","summary":"《西游记》全书共100回，可分成三大部分，主要描写孙悟空的出世和大闹天宫、唐僧的出世和取经缘由以及后来师徒四人历经九九八十一难，终于取得真经而归的故事。《西游记》的出现，开辟了神魔长篇章回小说这一新门类。书中将善意的嘲笑、辛辣的讽刺同严肃的批判巧妙结合起来，直接影响着讽刺小说的发展。在世界文学史上，它也具有重要地位，《美同大百科全书》认为它是\u201c一部具有丰富内容和光辉思想的神话小说\u201d。从19世纪起，《西游记》就被翻译为日、英、法、德、俄等10多种文字流行于世。","series":{"id":"10592","title":"家庭书架·传世经典读库"},"price":"19.90元"},{"rating":{"max":10,"numRaters":64,"average":"8.9","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2009-1","tags":[{"count":16,"name":"四大名著","title":"四大名著"},{"count":10,"name":"古典名著","title":"古典名著"},{"count":6,"name":"小说","title":"小说"},{"count":5,"name":"西游记","title":"西游记"},{"count":5,"name":"吴承恩","title":"吴承恩"},{"count":5,"name":"古典文学","title":"古典文学"},{"count":2,"name":"文学","title":"文学"},{"count":2,"name":"中国文学","title":"中国文学"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s5986228.jpg","binding":"","translator":[],"catalog":"第 一 回  灵根育孕源流出  心性修持大道生第 二 回  悟彻菩提真妙理  断魔归本合元神第 三 回  四海千山皆拱伏  九幽十类尽除名第 四 回  官封弼马心何足  名注齐天意未宁第 五 回  乱蟠桃大圣偷丹  反天宫诸神捉怪第 六 回  观音赴会问原因  小圣施威降大圣第 七 回  八卦炉中逃大圣  五行山下定心猿第 八 回  我佛造经传极乐  观音奉旨上长安附录  陈光蕊赴任逢灾  江流僧复仇报本第 九 回  袁守诚妙算无私曲  老龙王拙计犯天条第 十 回  二将军宫门镇鬼  唐太宗地府还魂第十一回  还受生唐王遵善果  度孤魂萧瑀正空门第十二回  玄奘秉诚建大会  观音显像化金蝉第十三回  陷虎穴金星解厄  双叉岭伯钦留僧第十四回  心猿归正  六贼无踪第十五回  蛇盘山诸神暗佑  鹰愁涧意马收缰第十六回  观音院僧谋宝贝  黑风山怪窃袈裟第十七回  孙行者大闹黑风山  观世音收伏熊罴怪第十八回  观音院唐僧脱难  高老庄行者降魔第十九回  云栈洞悟空收八戒  浮屠山玄奘受心经第二十回  黄风岭唐僧有难  半山中八戒争先第二十一回  护法设庄留大圣  须弥灵吉定风魔第二十二回  八戒大战流沙河  木叉奉法收悟净第二十三回  三藏不忘本  四圣试禅心第二十四回  万寿山大仙留故友  五庄观行者窃人参第二十五回  镇元仙赶捉取经僧  孙行者大闹五庄观第二十六回  孙悟空三岛求方  观世音甘泉活树第二十七回  尸魔三戏唐三藏  圣僧恨逐美猴王第二十八回  花果山群妖聚义  黑松林三藏逢魔第二十九回  脱难江流来国土  承恩八戒转山林第三十回  邪魔侵正法  意马忆心猿第三十一回  猪八戒义激猴王  孙行者智降妖怪第三十二回  平顶山功曹传信  莲花洞木母逢灾第三十三回  外道迷真性  元神助本心第三十四回  魔王巧算困心猿  大圣腾那骗宝贝第三十五回  外道施威欺正性  心猿获宝伏邪魔第三十六回  心猿正处诸缘伏  劈破旁门见月明第三十七回  鬼王夜谒唐三藏  悟空神化引婴儿第三十八回  婴儿问母知邪正  金木参玄见假真第三十九回  一粒金丹天上得  三年故主世间生第四十回  婴儿戏化禅心乱  猿马刀归木母空第四十一回  心猿遭火败  木母被魔擒第四十二回  大圣殷勤拜南海  观音慈善缚红孩第四十三回  黑河妖孽擒僧去  西洋龙子捉鼍回第四十四回  法身元运逢车力  心正妖邪度脊关第四十五回  三清观大圣留名  车迟国猴王显法第四十六回  外道弄强欺正法  心猿显圣灭诸邪第四十七回  圣僧夜阻通天水  金木垂慈救小童第四十八回  魔弄寒风飘大雪  僧思拜佛履层冰第四十九回  三藏有灾沉水宅  观音救难现鱼篮第五十回  情乱性从因爱欲  神昏心动遇魔头第五十一回  心猿空用千般计  水火无功难炼魔第五十二回  悟空大闹金岘洞  如来暗示主人公第五十三回  禅主吞餐怀鬼孕  黄婆运水解邪胎第五十四回  法性西来逢女国  心猿定计脱烟花第五十五回  色邪淫戏唐三藏  性正修持不坏身第五十六回  神狂诛草寇  道昧放心猿第五十七回  真行者落伽山诉苦  假猴王水帘洞誊文第五十八回  二心搅乱大乾坤  一体难修真寂灭第五十九回  唐三藏路阻火焰山  孙行者一调芭蕉扇第六十回  牛魔王罢战赴华筵  孙行者二调芭蕉扇第六十一回  猪八戒助力败魔王  孙行者三调芭蕉扇第六十二回  涤垢洗心惟扫塔  缚魔归正乃修身第六十三回  二僧荡怪闹龙宫  群圣除邪获宝贝第六十四回  荆棘岭悟能努力  木仙庵三藏谈诗第六十五回  妖邪假设小雷音  四众皆遭大厄难第六十六回  诸神遭毒手  弥勒缚妖魔第六十七回  拯救驼罗禅性稳  脱离秽污道心清第六十八回  朱紫国唐僧论前世  孙行者施为三折肱第六十九回  心主夜间修药物  君王筵上论妖邪第七十回  妖魔宝放烟沙火  悟空计盗紫金铃第七十一回  行者假名降怪犰  观音现象伏妖王第七十二回  盘丝洞七情迷本  濯垢泉八戒忘形第七十三回  情因旧恨生灾毒  心主遭魔幸破光第七十四回  长庚传报魔头狠  行者施为变化能第七十五回  心猿钻透阴阳窍  魔王还归大道真第七十六回  心神居舍魔归性  木母同降怪体真第七十七回  群魔欺本性  一体拜真如第七十八回  比丘怜子遣阴神  金殿识魔谈道德第七十九回  寻洞擒妖逢老寿  当朝正主救婴儿第八十回  姹女育阳求配偶  心猿护主识妖邪第八十一回  镇海寺心猿知怪  黑松林三众寻师第八十二回  姹女求阳  元神护道第八十三回  心猿识得丹头  姹女还归本性第八十四回  难灭伽持圆大觉  法王成正体天然第八十五回  心猿妒木母  魔主计吞禅第八十六回  木母助威征怪物  金公施法灭妖邪第八十七回  凤仙郡冒天止雨  孙大圣劝善施霖第八十八回  禅到玉华施法会  心猿木母授门人第八十九回  黄狮精虚设钉钯宴  金木土计闹豹头山第九十回  师狮授受同归一  盗道缠禅静九灵第九十一回  金平府元夜观灯  玄英洞唐僧供状第九十二回  三僧大战青龙山  四星挟捉犀牛怪第九十三回  给孤园问古谈因  天竺国朝王遇偶第九十四回  四僧宴乐御花园  一怪空怀情欲喜第九十五回  假合真形擒玉兔  真阴归正会灵元第九十六回  寇员外喜待高僧  唐长老不贪富贵第九十七回  金酬外护遭魔毒  圣显幽魂救本原第九十八回  猿熟马驯方脱壳  功成行满见真如第九十九回  九九数完魔划尽  三三行满道归根第一百回  径回  东土  五圣成真阅读与思考","pages":"912","images":{"small":"https://img1.doubanio.com/spic/s5986228.jpg","large":"https://img1.doubanio.com/lpic/s5986228.jpg","medium":"https://img1.doubanio.com/mpic/s5986228.jpg"},"alt":"https://book.douban.com/subject/3535360/","id":"3535360","publisher":"岳麓","isbn10":"7807611308","isbn13":"9787807611301","title":"西游记","url":"https://api.douban.com/v2/book/3535360","alt_title":"","author_intro":"","summary":"《西游记》作者吴承恩，字汝忠，号射阳居士 ，《西游记》是吴承恩中年时期写成初稿，后来经过润饰而成的。他在前代多年积累下来并在民间流传的有关唐僧取经的文学作品和故事的基础上进行艺术再创造，并且把原来的以唐僧取经为主的故事，改为孙悟空为主的战天斗地史。\n孙悟空是全书中最光辉的形象。\u201c 大闹天宫\u201d突出他热爱自由、勇于反抗的精神\u201c西天取经\u201d表现他见恶必除、除恶必尽的精神。孙悟空大闹天宫失败后，经过五行山下五百年的镇压，被唐僧放出，同往西天。他已不再是一个叛逆者的形象，而是一个头戴紧箍，身穿虎皮裙，专为人间解除魔难的英雄。在重重困难之前顽强不屈，随机应机，就是镇魔者孙悟空的主要特征。\n《西游记》描写的幻想世界和神话人物，大都有现实生活作基础，同时在神奇的形态下体现了作家与人民的某些美好愿望。八十一难、七十二变、各种神魔的本领都充满幻想色彩；五花八门、奇光异彩的宝贝，显然是人们为了征服自然或战胜敌人才假想出来的。","price":"25.00元"},{"rating":{"max":10,"numRaters":55,"average":"9.2","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2007-6","tags":[{"count":17,"name":"四大名著","title":"四大名著"},{"count":10,"name":"吴承恩","title":"吴承恩"},{"count":7,"name":"古典文学","title":"古典文学"},{"count":2,"name":"西游记","title":"西游记"},{"count":2,"name":"中国古代文学","title":"中国古代文学"},{"count":1,"name":"齐天大圣","title":"齐天大圣"},{"count":1,"name":"重温名著","title":"重温名著"},{"count":1,"name":"神话小说","title":"神话小说"}],"origin_title":"","image":"https://img1.doubanio.com/mpic/s24557289.jpg","binding":"","translator":[],"catalog":"题辞第 一 回 灵根育孕源流出 心性修持大道生第 二 回 悟彻菩提真妙理 断魔归本合元神第 三 回 四海千山皆拱伏 九幽十类尽除名第 四 回 官封弼马心何足 名注齐天意未宁第 五 回 乱蟠桃大圣偷丹 反天宫诸神捉怪第 六 回 观音赴会问原因 小圣施威降大圣第 七 回 八封炉中逃大圣 五行山下定心猿第 八 回 我佛造经传极乐 观音奉旨上长安第 九 回 袁守诚妙算无私曲 老龙王拙计犯天条第 十 回 二将军宫门镇鬼 唐太宗地府还魂第十一回 还受生唐王遵善果 度孤魂瑀萧正空门第十二回 玄奘秉诚建大会 观音显相化金蝉第十三回 陷虎穴金星解厄 双叉岭伯钦留僧第十四回 心猿归正 六贼无踪第十五回 蛇盘山诸神暗佑 鹰愁涧意马收缰第十六回 观音院僧谋宝贝 黑风山怪窃袈裟第十七回 孙行者大闹黑风山 观世音收伏熊罴怪第十八回 观音院唐僧脱难 高老庄大圣除魔第十九回 云栈洞悟空收八戒 浮屠山玄奘受心经第二 十回 黄风岭唐僧有难 半山中八戒争先第二十一回 护法设庄留大圣 须弥灵吉定风魔第二十二回 八戒大战流沙河 木叉奉法收悟净第二十三回 三藏不忘本 四圣试禅心第二十四回 万寿山大仙留故友 五庄观行者窃人参第二十五回 镇元仙赶捉取经僧 孙行者大闹五庄观第二十六回 孙悟空三岛求方 观世音甘泉活树第二十七回 尸魔三戏唐三藏 圣僧恨逐美猴王第二十八回 花果山群妖聚义 黑松林三藏逢魔第二十九回 脱难江流来国土 承恩八戒转山林第三 十回 邪魔侵正法 意马忆心猿第三十一回 猪八戒义激猴王 孙行者智降妖怪第三十二回 平顶山功曹传信 莲花洞木母逢灾第三十三回 外道迷真性 元神助本心第三十四回 魔王巧算困心猿 大圣腾挪骗宝贝第三十五回 外道施威欺正性 心猿获宝伏邪魔第三十六回 心猿正处诸缘伏 劈破旁门见月明第三十七回 鬼王夜谒唐三藏 悟空神化引婴儿第三十八回 婴儿问母知邪正 金木参玄见假真第三十九回 一粒金丹天上得 三年故主世间生第四 十回 婴儿戏化禅心乱 猿马刀圭木母空第四十一回 心猿遭火败 木母被魔擒第四十二回 大圣殷勤拜南海 观音慈善缚红孩第四十三回 黑河妖孽擒僧去 西洋龙子捉鼍回第四十四回 法身元运逢车力 心正妖邪度脊关第四十五回 三清观大圣留名 车迟国猴王显法第四十六回 外道弄强欺正法 心猿显圣灭诸邪第四十七回 圣僧夜阻通天水 金木垂慈救小童第四十八回 魔弄寒风飘大雪 僧思拜佛履层冰第四十九回 三藏有灾沉水宅 观音救难现鱼篮第五 十回 情乱性从因爱欲 神昏心动遇魔头第五十一回 心猿空用千般计 水火无功难炼魔第五十二回 悟空大闹金（山兜）洞 如来暗示主人公第五十三回 禅主吞餐怀鬼孕 黄婆运水解邪胎第五十四回 法性西来逢女国 心猿定计脱烟花第五十五回 色邪淫戏唐三藏 性正修持不坏身第五十六回 神狂诛草寇 道昧放心猿第五十七回 真行者落伽山诉苦 假猴王水帘洞誊文第五十八回 二心搅乱大乾坤 一体难修真寂灭第五十九回 唐三藏路阻火焰山 孙行者一调芭蕉扇第六 十回 牛魔王罢战赴华筵 孙行者二调芭蕉扇第六十一回 猪八戒助力败魔王 孙行者三调芭蕉扇第六十二回 涤垢洗心惟扫塔 缚魔归正乃修身第六十三回 二僧荡怪闹龙宫 群圣除邪获宝贝第六十四回 荆棘岭悟能努力 木仙庵三藏谈诗第六十五回 妖邪假设小雷音 四众皆遭大厄难第六十六回 诸神遭毒手 弥勒缚妖魔第六十七回 拯救驼罗禅性稳 脱离秽污道心清第六十八回 朱紫国唐僧论前世 孙行者施为三折肱第六十九回 心主夜间修药物 君王筵上论妖邪第七 十回 妖魔宝放烟沙火 悟空计盗紫金铃第七十一回 行者假名降怪犼 观音现相伏妖王第七十二回 盘丝洞七情迷本 濯垢泉八戒忘形第七十三回 情因旧恨生灾毒 心主遭魔幸破光第七十四回 长庚传报魔头狠 行者施为变化能第七十五回 心猿钻透阴阳窍 魔王还归大道真第七十六回 心神居舍魔归性 木母同降怪体真第七十七回 群魔欺本性 一体拜真如第七十八回 比丘怜子遣阴神 金殿识魔谈道德第七十九回 寻洞擒妖逢老寿 当朝正主救婴儿第八 十回 姹女育阳求配偶 心猿护主识妖邪第八十一回 镇海寺心猿知怪 黑松林三众寻师第八十二回 姹女求阳 元神护道第八十三回 心猿识得丹头 姹女还归本性第八十四回 难灭伽持圆大觉 法王成正体天然第八十五回 心猿妒木母 魔主计吞禅第八十六回 木母助威征怪物 金公施法灭妖邪第八十七回 凤仙郡冒天致旱 孙大圣劝善施霖第八十八回 禅到玉华施法会 心猿木母授门人第八十九回 黄狮精虚设钉钯宴 金木土计闹豹头山第九 十回 师狮授受同归一 盗道缠禅静九灵第九十一回 金平府元夜观灯 玄英洞唐僧供状第九十二回 三僧大战青龙山 四星挟捉犀牛怪第九十三回 给孤园问古谈因 天竺国朝王遇偶第九十四回 四僧宴乐御花园 一怪空怀情欲喜第九十五回 假合形骸擒玉兔 真阴归正会灵元第九十六回 寇员外喜待高僧 唐长老不贪富贵第九十七回 金酬外护遭魔毒 圣显幽魂救本原第九十八回 猿熟马驯方脱壳 功成行满见真如第九十九回 九九数完魔灭尽 三三行满道归根第一 百回 径回东土 五圣成校点后记","pages":"747","images":{"small":"https://img1.doubanio.com/spic/s24557289.jpg","large":"https://img1.doubanio.com/lpic/s24557289.jpg","medium":"https://img1.doubanio.com/mpic/s24557289.jpg"},"alt":"https://book.douban.com/subject/2128483/","id":"2128483","publisher":"山东齐鲁书社","isbn10":"7533318110","isbn13":"9787533318116","title":"西游记","url":"https://api.douban.com/v2/book/2128483","alt_title":"","author_intro":"","summary":"《西游记》主要描写了唐僧西天取经，路上先后收了孙悟空、猪八戒、沙和尚三个徒弟，并历经九九八十一难，终于取到了真经，修成了正果。它向人们展示了一个绚丽多彩的神魔世界，人们无不在作者丰富而大胆的艺术想象面前惊叹不已。 \n《西游记》不仅有较深刻的思想内容，艺术上也取得了很高的成就。它以丰富奇特的艺术想象、生动曲折的故事情节，栩栩如生的人物形象，幽默诙谐的语言，构筑了一座独具特色的艺术宫殿。","price":"18.00元"},{"rating":{"max":10,"numRaters":20,"average":"8.9","min":0},"subtitle":"世界文学名著文库","author":["吴承恩"],"pubdate":"2001-12-01","tags":[{"count":5,"name":"中国古典文学","title":"中国古典文学"},{"count":4,"name":"小说","title":"小说"},{"count":1,"name":"西游记","title":"西游记"},{"count":1,"name":"莎士比亚","title":"莎士比亚"},{"count":1,"name":"吴承恩","title":"吴承恩"},{"count":1,"name":"古典文学","title":"古典文学"},{"count":1,"name":"古典小说","title":"古典小说"},{"count":1,"name":"中国文学","title":"中国文学"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s2405701.jpg","binding":"精装","translator":[],"catalog":"\n      ","pages":"1198","images":{"small":"https://img3.doubanio.com/spic/s2405701.jpg","large":"https://img3.doubanio.com/lpic/s2405701.jpg","medium":"https://img3.doubanio.com/mpic/s2405701.jpg"},"alt":"https://book.douban.com/subject/1667629/","id":"1667629","publisher":"人民文学出版社","isbn10":"7020036554","isbn13":"9787020036554","title":"西游记","url":"https://api.douban.com/v2/book/1667629","alt_title":"","author_intro":"","summary":"\n      ","series":{"id":"4146","title":"世界文学名著文库"},"price":"52.00元"},{"rating":{"max":10,"numRaters":6,"average":"0.0","min":0},"subtitle":"西游记鉴赏辞典","author":["李时人","张兵","刘廷乾"],"pubdate":"2013-10-1","tags":[{"count":5,"name":"古典文学","title":"古典文学"},{"count":2,"name":"西游记","title":"西游记"},{"count":1,"name":"辞典","title":"辞典"},{"count":1,"name":"经典","title":"经典"},{"count":1,"name":"工具书","title":"工具书"},{"count":1,"name":"小说","title":"小说"},{"count":1,"name":"中国","title":"中国"}],"origin_title":"西游记","image":"https://img3.doubanio.com/mpic/s29438950.jpg","binding":"平装","translator":[],"catalog":"","pages":"648","images":{"small":"https://img3.doubanio.com/spic/s29438950.jpg","large":"https://img3.doubanio.com/lpic/s29438950.jpg","medium":"https://img3.doubanio.com/mpic/s29438950.jpg"},"alt":"https://book.douban.com/subject/25815200/","id":"25815200","publisher":"上海辞书出版社","isbn10":"7532638251","isbn13":"9787532638253","title":"中国古代小说名著鉴赏系列","url":"https://api.douban.com/v2/book/25815200","alt_title":"西游记","author_intro":"李时人 张兵 刘廷乾三位作者都是明清小说史专家。李时人，上海师范大学人文学院教授兼文学研究所所长，国内知名的小说史研究专家，对西游记犹有建树，著有《西游记考论》。张兵，复旦大学编审，出版了大量小说研究论著。刘廷乾是后起新秀。","summary":"本书是\u201c中国古代小说名著鉴赏系列\u201d丛书之一。《西游记》作为中国古代小说名著，最是老少咸宜，是一部人人都能欣赏、人人愿意欣赏的小说。然而《西游记》无论其思想倾向、形象意义还是认识价值，都聚讼纷纭，这体现了它本身的复杂性和深度。其混同三教、滑稽诙谐的内容和风格，蕴藏着时代人生的切实内容和历史况味。鲁迅在《中国小说史略》中指出，《西游记》\u201c讽刺揶揄则取当时世态，加以铺张描写\u201d。又说：\u201c作者禀性，\u2018复善谐剧\u2019，故虽述变幻恍忽之事，亦每杂解颐之言，使神魔皆有人情，精魅亦通世故。\u201d《西游记鉴赏辞典》遴选\u201c偷桃乱盛会\u201d、\u201c三打白骨精\u201d、\u201c大闹三清观\u201d、\u201c真假美猴王\u201d、\u201c灵山见佛祖\u201d等76个重要情节和唐僧师徒四人、观音菩萨、太白金星、牛魔王等31个主要人物进行鉴赏，帮助读者确切把握《西游记》所包含的社会内容、精神意蕴，深入体验小说谐谑的艺术风格，并从欣赏中得到真正能的审美愉悦。","price":"CNY 49.80"},{"rating":{"max":10,"numRaters":3,"average":"0.0","min":0},"subtitle":"","author":["吴承恩"],"pubdate":"2012-11","tags":[{"count":2,"name":"小说","title":"小说"},{"count":2,"name":"中国","title":"中国"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s24574770.jpg","binding":"","translator":[],"catalog":"","pages":"601","images":{"small":"https://img3.doubanio.com/spic/s24574770.jpg","large":"https://img3.doubanio.com/lpic/s24574770.jpg","medium":"https://img3.doubanio.com/mpic/s24574770.jpg"},"alt":"https://book.douban.com/subject/20419277/","id":"20419277","publisher":"岳麓书社,中南出版传媒","isbn10":"7807619511","isbn13":"9787807619512","title":"西游记","url":"https://api.douban.com/v2/book/20419277","alt_title":"","author_intro":"","summary":"《中国古典小说普及文库:西游记》是我国古代文学四大名著之一。它主要取材于唐朝太宗时期，著名僧人唐玄奘受皇命上当时的天竺，即现在的印度，去取佛经。小说以丰富瑰奇的想像描写了师徒四人在崎岖漫长的西方取经途中和穷山恶水斗争的历程，并将所经历的千难万险形象化为妖魔鬼怪所设置的八十一难，以动物幻化的有情山精树怪，生动地表现了无情的山川险阻，并以降妖服怪赞颂了取经人排除艰难的战斗精神，小说大唱人定战胜自然的凯歌。在中国古代小说中，《中国古典小说普及文库:西游记》是一部思想性和艺术性都臻于第一流的伟大作品。它也是明代长篇小说的重要流派之一神魔小说的代表作，是中国古代神魔小说的翘楚、浪漫文学的代表，作者以其丰富的艺术想象力建构了一个光怪陆离的神话世界，并塑造出以孙悟空、猪八戒为代表的一批性格鲜明、影响深远的文学形象，数百年来一直为人们所喜闻乐见。","price":"14.00元"},{"rating":{"max":10,"numRaters":1,"average":"0.0","min":0},"subtitle":"","author":["[明] 吴承恩"],"pubdate":"2016-4","tags":[{"count":1,"name":"*北京·商务印书馆*","title":"*北京·商务印书馆*"}],"origin_title":"","image":"https://img3.doubanio.com/mpic/s28855243.jpg","binding":"精装","translator":[],"catalog":"","pages":"866","images":{"small":"https://img3.doubanio.com/spic/s28855243.jpg","large":"https://img3.doubanio.com/lpic/s28855243.jpg","medium":"https://img3.doubanio.com/mpic/s28855243.jpg"},"alt":"https://book.douban.com/subject/26827431/","id":"26827431","publisher":"商务印书馆","isbn10":"7100119693","isbn13":"9787100119696","title":"西游记","url":"https://api.douban.com/v2/book/26827431","alt_title":"","author_intro":"吴承恩，中国明代杰出的小说家，字汝忠，号射阳山人。先世涟水人，后徙居山阳（今淮安）。吴承恩出生于一个由下级官吏沦落为小商人的家庭，吴承恩特别喜欢搜奇猎怪，爱看神仙鬼怪、狐妖猴精之类的书籍，如《百怪录》《酉阳杂俎》之类的小说野史。这类五光十色的神话世界，潜移默化中养成了他搜奇猎怪的嗜好。随着年龄的增大，这种爱好有增无减。这对他创作《西游记》有着重大的影响。另外，科场的失意、生活的困顿，使他加深了对封建科举制度、黑暗社会现实的认识，促使他运用志怪小说的形式来表达内心的不满和愤懑。","summary":"《西游记》是一部散发着浓郁的浪漫主义气息的长篇小说，也是我国文学史上神魔小说的巅峰之作。它想象新奇、出神入化，已臻登峰造极之境界，经久不衰，老少皆欢、妇孺皆爱，影响着一代又一代的读者。小说不仅反映了明代社会各阶层人物生活状况及世态人情，而且还超越时空的界限，从哲理的高度渲染了人们对真善美的追求，反映了人类为了改造自然与社会，敢于不屈不挠地进行斗争的理想。\n编写过程中，本书选取流传最广、影响最大的版本为底稿，参校其他影印本、传抄本、点评本、收藏本，并配有精美绣像，帮助读者深刻理解名著。\n资深教育专家与教研员依据新课标，结合命题趋势，对本书的知识点、考点进行梳理总结，并依据商务印书馆《现代汉语词典》和《古代汉语词典》进行了注音、解词、释义、扫除读者阅读过程中遇到的障碍。\n著名文艺评论家、作者、百家讲坛主讲人之一马瑞芳教授作序，从小说的主旨、人物形象、结构布局、故事情节等几个方面进行解读，极具针对性与指导意义。","price":"40.00"}]
     */

    private int count;
    private int start;
    private int total;
    private List<BooksBean> books;

    public int getCount() {
        return count;
    }

    public void setCount(int count) {
        this.count = count;
    }

    public int getStart() {
        return start;
    }

    public void setStart(int start) {
        this.start = start;
    }

    public int getTotal() {
        return total;
    }

    public void setTotal(int total) {
        this.total = total;
    }

    public List<BooksBean> getBooks() {
        return books;
    }

    public void setBooks(List<BooksBean> books) {
        this.books = books;
    }

    public static class BooksBean {
        /**
         * rating : {"max":10,"numRaters":4437,"average":"9.2","min":0}
         * subtitle :
         * author : ["吴承恩"]
         * pubdate : 1994-04
         * tags : [{"count":906,"name":"四大名著","title":"四大名著"},{"count":717,"name":"小说","title":"小说"},{"count":648,"name":"西游记","title":"西游记"},{"count":561,"name":"古典文学","title":"古典文学"},{"count":344,"name":"中国古典文学","title":"中国古典文学"},{"count":332,"name":"中国","title":"中国"},{"count":312,"name":"名著","title":"名著"},{"count":262,"name":"古典","title":"古典"}]
         * origin_title :
         * image : https://img3.doubanio.com/mpic/s9125702.jpg
         * binding : 精装
         * translator : []
         * catalog : 前言
         校评说明
         第一回 灵根育孕源流出 心性修持大道生
         第二回 悟彻菩提真妙理 断魔归本合元神
         第三回 四海千山皆拱伏 九幽十类尽除名
         第四回 官封弼马心何足 名注齐天意未宁
         第五回 乱蟠桃大圣偷丹 反天宫诸神捉妖
         第六回 观音赴会问原因 小圣施威降大圣
         第七回 八卦炉中逃大圣 五行山下定心猿
         第八回 我佛造经传极乐 观音奉旨上长安
         第九回 袁守诚妙算无私曲 老龙王拙计犯天条
         第十回 二将军宫门镇鬼 唐太宗地府还魂
         * pages : 764
         * images : {"small":"https://img3.doubanio.com/spic/s9125702.jpg","large":"https://img3.doubanio.com/lpic/s9125702.jpg","medium":"https://img3.doubanio.com/mpic/s9125702.jpg"}
         * alt : https://book.douban.com/subject/1061803/
         * id : 1061803
         * publisher : 岳麓书社
         * isbn10 : 7805200556
         * isbn13 : 9787805200552
         * title : 西游记
         * url : https://api.douban.com/v2/book/1061803
         * alt_title :
         * author_intro : 吴承恩(1501年-1582年)，汉族。字汝忠，号射阳山人，淮安府山阳县（今江苏省淮安市楚州区）人,明代小说家。吴承恩大约40岁才补得一个岁贡生，到北京等待分配官职，没有被选上，由于母老家贫，去做了长兴县丞，终因受人诬告，两年后“拂袖而归”，晚年以卖文为生，大约活了82岁。
         《天启淮安府志》评价他“性敏而多慧，博极群书，为诗文下笔立成，清雅流丽，有秦少游之风。复善谐谑，所著杂记几种，名震一时”。不过都是他死后的事了。他一生创作丰富，但是由于家贫，又没有子女，作品多散失。据记载有志怪小说集《禹鼎记》已失传。目前只遗留后人辑的《射阳先生存稿》四卷。一般公认他是中国的《西游记》的最后定稿作者，但也有观点认为不是，目前在学术界保持着争议(旧时传说是元朝的全真教道人丘处机)。
         出生于一个由下级官吏沦落为小商人的家庭，他的父亲吴锐性格乐观旷达，奉行常乐哲学，为儿子取名承恩，字汝忠，意思希望他能读书做官，上承皇恩，下泽黎民，做一个青史留名的忠臣。吴承恩小时候勤奋好学，一目十行，过目成诵。他精于绘画，擅长书法，爱好填词度曲，对围棋也很精通，还喜欢收藏名人的书画法帖。少年时代他就因为文才出众而在故乡出了名，受到人们的赏识，认为他科举及第，“如拾一芥”。
         他除奋好学外，特别喜欢搜奇猎怪，爱看神仙鬼怪，狐妖猴精之类的书籍。如《百怪录》、《酉阳杂俎》之类的小说野史，这类五光十色的神话世界，潜默化中养成了搜奇猎怪的嗜好，随着年龄的增大，这种爱好有增无减，这对他创作《西游记》有着重大的影响。30岁后，他搜求的奇闻已“贮满胸中”了，并且有了创作的打算。50岁左右，他写了《西游记》的前十几回，后来因故中断了多年，直到晚年辞官离任回到故里，他才得以最后完成《西游记》的创作，历时7年。
         步入青年时代的吴承恩是狂放不羁、轻世傲物的年青人。社会地位的低下，贫穷困苦的处境，使这位大才子狂放不羁，招来了纷至沓来的笑声，被人交口称誉的日子一去不复返了。吴承恩约二十岁时，与同乡一位姓叶的姑娘结婚，婚后感情甚笃。吴承恩虽然狂放不羁，但他品行端正，忠于自己的妻室。嘉靖十年，吴承恩在府学岁考和科考中获得了优异成绩，取得了科举生员的资格，与朋友结伴去南京应乡试。然而才华不如他的同伴考取了，他这位誉满乡里的才子竟名落孙山。第二年春天，他的父亲怀着遗憾去世了。接受初次失败的教训，吴承恩在以后三年内，专心致意地在时文上下了一番苦功，在嘉靖十三年秋的考试中却仍然没有考中。吴承恩羞恨交加，这年冬天，竟病倒了。两次乡试的失利，再加上父亲的去世，对吴承恩的打击是沉重的。在他看来，考不取举人，不仅付资无由，而且愧对父母，有负先人。但他并不以为自己没考取是没本事，而只是命运不济，他认为“功名富贵自有命，必须得之无乃痴？”
         吴承恩一生不同流俗，刚直不阿。他之所以才高而屡试不第，很可能与他不愿作违心之论以讨好上官有关。他厌恶腐败的官场，不愿违背本心，对黑暗的现实持否定态度。他在《二郎搜山图歌》一诗中写道：“民灾翻出衣冠中，不为猿鹤为沙虫。坐观宋室用五鬼，不见虞廷诛四凶。野夫有怀多感激，抚事临风三叹惜。胸中磨损斩邪刀，欲起平之恨无力。救月有矢救日弓，世间岂谓无英雄？谁能为我致麟凤，长令万年保合清宁功。”认为“民灾”的形成，社会现实的丑恶，原因就在于统治者用人不善，让“五鬼”“四凶”那样的坏人当道。他想“致麟凤”，行“王道”，扭转乾坤，但是怀才不遇，壮志未酬，只能空怀慷慨，抚事临风叹息。生活困顿给吴承恩带来的压力并不小于科考的失利。父亲去世以后，他需要操持全家的所有开支，但他却没有支撑门户的能力，更没有养家活口的手段。家中生活来源，除了每月从学府里领回六斗米外，只能坐食父亲所留遗产了。品尝了社会人生酸甜苦辣的吴承恩，开始更加清醒地、深沉地考虑社会人生的问题，并且用自己的诗文向不合理的社会进行抗争。
         * summary : 《西游记》的艺术虚构正是建立在传统艺术经验和这种社会的宗教性观念和风习的基础之上的，但它又以作者融会了传统艺术经验所形成的艺术的独创性批判了社会的宗教性观念，或更正确地说，和社会的宗教性观念开了玩笑，进行了潮弄。这是这部演述超人间故事的神魔小说最突出、最优异的品质，也是它的艺术价值和魅力的最根本的所在。
         《西游记》的主旨就是在于政治批判，那就和小说的形象和意蕴不符了。对现实政治的讽刺顶多只是这部神魔小说的附带性的内容，是信手拈来之笔，是讽喻世态人情中的涉笔成趣。一部小说如果不包含丰富的、多元的、在众多棱面上映射出众多意象的内涵，就不成其为多姿多采的有生命力的艺术品，不会万古长新。
         * series : {"id":"10185","title":"古典名著普及文库"}
         * price : 15.00
         */

        private RatingBean rating;
        private String subtitle;
        private String pubdate;
        private String origin_title;
        private String image;
        private String binding;
        private String catalog;
        private String pages;
        private ImagesBean images;
        private String alt;
        private String id;
        private String publisher;
        private String isbn10;
        private String isbn13;
        private String title;
        private String url;
        private String alt_title;
        private String author_intro;
        private String summary;
        private SeriesBean series;
        private String price;
        private List<String> author;
        private List<TagsBean> tags;
        private List<?> translator;

        public RatingBean getRating() {
            return rating;
        }

        public void setRating(RatingBean rating) {
            this.rating = rating;
        }

        public String getSubtitle() {
            return subtitle;
        }

        public void setSubtitle(String subtitle) {
            this.subtitle = subtitle;
        }

        public String getPubdate() {
            return pubdate;
        }

        public void setPubdate(String pubdate) {
            this.pubdate = pubdate;
        }

        public String getOrigin_title() {
            return origin_title;
        }

        public void setOrigin_title(String origin_title) {
            this.origin_title = origin_title;
        }

        public String getImage() {
            return image;
        }

        public void setImage(String image) {
            this.image = image;
        }

        public String getBinding() {
            return binding;
        }

        public void setBinding(String binding) {
            this.binding = binding;
        }

        public String getCatalog() {
            return catalog;
        }

        public void setCatalog(String catalog) {
            this.catalog = catalog;
        }

        public String getPages() {
            return pages;
        }

        public void setPages(String pages) {
            this.pages = pages;
        }

        public ImagesBean getImages() {
            return images;
        }

        public void setImages(ImagesBean images) {
            this.images = images;
        }

        public String getAlt() {
            return alt;
        }

        public void setAlt(String alt) {
            this.alt = alt;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getPublisher() {
            return publisher;
        }

        public void setPublisher(String publisher) {
            this.publisher = publisher;
        }

        public String getIsbn10() {
            return isbn10;
        }

        public void setIsbn10(String isbn10) {
            this.isbn10 = isbn10;
        }

        public String getIsbn13() {
            return isbn13;
        }

        public void setIsbn13(String isbn13) {
            this.isbn13 = isbn13;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getAlt_title() {
            return alt_title;
        }

        public void setAlt_title(String alt_title) {
            this.alt_title = alt_title;
        }

        public String getAuthor_intro() {
            return author_intro;
        }

        public void setAuthor_intro(String author_intro) {
            this.author_intro = author_intro;
        }

        public String getSummary() {
            return summary;
        }

        public void setSummary(String summary) {
            this.summary = summary;
        }

        public SeriesBean getSeries() {
            return series;
        }

        public void setSeries(SeriesBean series) {
            this.series = series;
        }

        public String getPrice() {
            return price;
        }

        public void setPrice(String price) {
            this.price = price;
        }

        public List<String> getAuthor() {
            return author;
        }

        public void setAuthor(List<String> author) {
            this.author = author;
        }

        public List<TagsBean> getTags() {
            return tags;
        }

        public void setTags(List<TagsBean> tags) {
            this.tags = tags;
        }

        public List<?> getTranslator() {
            return translator;
        }

        public void setTranslator(List<?> translator) {
            this.translator = translator;
        }

        public static class RatingBean {
            /**
             * max : 10
             * numRaters : 4437
             * average : 9.2
             * min : 0
             */

            private int max;
            private int numRaters;
            private float average;
            private int min;

            public int getMax() {
                return max;
            }

            public void setMax(int max) {
                this.max = max;
            }

            public int getNumRaters() {
                return numRaters;
            }

            public void setNumRaters(int numRaters) {
                this.numRaters = numRaters;
            }

            public float getAverage() {
                return average;
            }

            public void setAverage(float average) {
                this.average = average;
            }

            public int getMin() {
                return min;
            }

            public void setMin(int min) {
                this.min = min;
            }
        }

        public static class ImagesBean {
            /**
             * small : https://img3.doubanio.com/spic/s9125702.jpg
             * large : https://img3.doubanio.com/lpic/s9125702.jpg
             * medium : https://img3.doubanio.com/mpic/s9125702.jpg
             */

            private String small;
            private String large;
            private String medium;

            public String getSmall() {
                return small;
            }

            public void setSmall(String small) {
                this.small = small;
            }

            public String getLarge() {
                return large;
            }

            public void setLarge(String large) {
                this.large = large;
            }

            public String getMedium() {
                return medium;
            }

            public void setMedium(String medium) {
                this.medium = medium;
            }
        }

        public static class SeriesBean {
            /**
             * id : 10185
             * title : 古典名著普及文库
             */

            private String id;
            private String title;

            public String getId() {
                return id;
            }

            public void setId(String id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }

        public static class TagsBean {
            /**
             * count : 906
             * name : 四大名著
             * title : 四大名著
             */

            private int count;
            private String name;
            private String title;

            public int getCount() {
                return count;
            }

            public void setCount(int count) {
                this.count = count;
            }

            public String getName() {
                return name;
            }

            public void setName(String name) {
                this.name = name;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }
        }
    }
}
